{
  "Amazon Elasticsearch Service": {
    "name": "Amazon Elasticsearch Service",
    "type": "Log Analysis",
    "classification": "Analytics Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/analytics_services.svg",
    "description": "Amazon Elasticsearch Service is a fully managed service that makes it easy to deploy, manage, and scale Elasticsearch clusters in the AWS Cloud. It provides the flexibility to securely search, analyze, and visualize data in real-time.",
    "properties": {},
    "tags": []
  },
  "Amazon EMR": {
    "name": "Amazon EMR",
    "type": "Big Data Processing",
    "classification": "Analytics Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/analytics_services.svg",
    "description": "Amazon EMR is a cloud-native big data platform, allowing processing of vast amounts of data quickly and cost-effectively across resizable clusters of Amazon EC2 instances.",
    "properties": {},
    "tags": []
  },
  "Amazon QuickSight": {
    "name": "Amazon QuickSight",
    "type": "Business Intelligence",
    "classification": "Analytics Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/analytics_services.svg",
    "description": "Amazon QuickSight is a scalable, serverless, embeddable, machine learning-powered business intelligence (BI) service built for the cloud.",
    "properties": {},
    "tags": []
  },
  "AWS CloudTrail": {
    "name": "AWS CloudTrail",
    "type": "Log Analysis",
    "classification": "Analytics Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/analytics_services.svg",
    "description": "AWS CloudTrail is a service that enables governance, compliance, operational auditing, and risk auditing of your AWS account. It records and retains account activity related to actions across your AWS infrastructure, providing a complete audit trail of user activities and API usage.",
    "properties": {},
    "tags": []
  },
  "AWS Glue Data Catalog": {
    "name": "AWS Glue Data Catalog",
    "type": "Data Governance",
    "classification": "Analytics Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/analytics_services.svg",
    "description": "AWS Glue Data Catalog is a central repository to store structural and operational metadata for all your data assets, making it a fully managed, scalable, and serverless data catalog.",
    "properties": {},
    "tags": []
  },
  "AWS Lake Formation": {
    "name": "AWS Lake Formation",
    "type": "Data Lakes",
    "classification": "Analytics Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/analytics_services.svg",
    "description": "AWS Lake Formation is a service that makes it easy to set up a secure data lake in days. It simplifies and automates the process of building, securing, and managing data lakes.",
    "properties": {},
    "tags": []
  },
  "Amazon API": {
    "name": "Amazon API",
    "type": "API Management",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "Amazon API Gateway is a fully managed service that makes it easy for developers to create, publish, maintain, monitor, and secure APIs at any scale. It handles all the tasks involved in accepting and processing up to hundreds of thousands of concurrent API calls, including traffic management, authorization and access control, monitoring, and API version management.",
    "properties": {},
    "tags": []
  },
  "Amazon API Resource": {
    "name": "Amazon API Resource",
    "type": "API Management",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "The Amazon API Gateway Resource represents an individual API endpoint within a RESTful API. It acts as a container for the methods (such as GET, POST, etc.) that define how API requests are processed and routed to backend services. Each resource can be mapped to a specific URL path and can be used to model different entities or actions within an API. Resources can also have child resources to create hierarchical API structures.",
    "properties": {},
    "tags": []
  },
  "Amazon API Resource Method": {
    "name": "Amazon API Resource Method",
    "type": "API Management",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "The Amazon API Gateway Resource Method defines the specific HTTP request type (e.g., GET, POST, PUT) that a resource supports. It specifies how API Gateway should process the request, including integration with backend services (e.g., Lambda, HTTP, or other AWS services), request/response mapping, authentication, and authorization settings. Each method can have different configurations for request validation, caching, and throttling.",
    "properties": {},
    "tags": []
  },
  "Amazon Kinesis": {
    "name": "Amazon Kinesis",
    "type": "Event Stream Processing",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "Amazon Kinesis makes it easy to collect, process, and analyze real-time, streaming data so you can get timely insights and react quickly to new information. With Kinesis, you can ingest real-time data such as video, audio, application logs, website clickstreams, and IoT telemetry data for machine learning, analytics, and other applications.",
    "properties": {},
    "tags": []
  },
  "Amazon MQ": {
    "name": "Amazon MQ",
    "type": "Enterprise Service Bus",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "Amazon MQ is a managed message broker service for Apache ActiveMQ and RabbitMQ that makes it easy to set up and operate message brokers in the cloud. It provides a reliable and scalable message broker service without the need to manage the underlying infrastructure.",
    "properties": {},
    "tags": []
  },
  "Amazon SQS": {
    "name": "Amazon SQS",
    "type": "Message Queues",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "Amazon SQS is a fully managed message queuing service that enables you to decouple and scale microservices, distributed systems, and serverless applications. It provides a reliable, highly scalable, hosted queue for storing messages as they travel between computers.",
    "properties": {},
    "tags": []
  },
  "AWS DataSync": {
    "name": "AWS DataSync",
    "type": "Data Integration Tools",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "AWS DataSync is a data transfer service that makes it easy to move data between on-premises storage and Amazon S3 or Amazon Elastic File System (EFS). It can be used for migrating active datasets, archiving data, or replicating data for disaster recovery.",
    "properties": {},
    "tags": []
  },
  "AWS Glue": {
    "name": "AWS Glue",
    "type": "Data Integration Tools",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "AWS Glue is a fully managed extract, transform, and load (ETL) service that makes it easy for customers to prepare and load their data for analytics. You can create and run an ETL job with a few clicks in the AWS Management Console, and AWS Glue automatically discovers your data and stores the associated metadata in the AWS Glue Data Catalog.",
    "properties": {},
    "tags": []
  },
  "AWS Step Functions": {
    "name": "AWS Step Functions",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "AWS Step Functions is a serverless function orchestrator that makes it easy to sequence AWS Lambda functions and multiple AWS services into business-critical applications. It provides a visual interface to orchestrate microservices, serverless applications, and workflows, ensuring they are executed in order and as expected.",
    "properties": {},
    "tags": []
  },
  "Amazon Managed Blockchain": {
    "name": "Amazon Managed Blockchain",
    "type": "Blockchain as a Service",
    "classification": "Blockchain",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/blockchain.svg",
    "description": "Amazon Managed Blockchain is a fully managed service that makes it easy to create and manage scalable blockchain networks using popular open-source frameworks such as Hyperledger Fabric and Ethereum. It eliminates the overhead required to create the network and automatically scales to meet the demands of thousands of applications running millions of transactions.",
    "properties": {},
    "tags": [
      "Smart Contracts",
      "Decentralized Applications",
      "Consensus Services",
      "Blockchain Networks"
    ]
  },
  "Amazon EC2 Dedicated Hosts": {
    "name": "Amazon EC2 Dedicated Hosts",
    "type": "Dedicated Hosts",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "Amazon EC2 Dedicated Hosts are physical servers with EC2 instance capacity fully dedicated to your use. They allow you to use your existing server-bound software licenses and can help you meet compliance requirements. Using Dedicated Hosts helps you address compliance requirements and reduce costs by allowing you to use your existing server-bound software licenses.",
    "properties": {},
    "tags": []
  },
  "Amazon EC2 G4 instances": {
    "name": "Amazon EC2 G4 instances",
    "type": "GPU/Accelerated Computing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "Amazon EC2 G4 Instances are designed to provide a cost-effective platform for deploying machine learning inference applications and graphics-intensive applications. They offer a powerful combination of CPU and GPU resources for purposes like gaming, graphics rendering, and video processing.",
    "properties": {},
    "tags": []
  },
  "Amazon EC2 P3": {
    "name": "Amazon EC2 P3",
    "type": "GPU/Accelerated Computing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "Amazon EC2 P3 Instances are designed for compute-intensive applications that require high-performance GPU computing. They are ideal for machine learning, high-performance computing (HPC), scientific simulations, and 3D visualization tasks.",
    "properties": {},
    "tags": []
  },
  "Amazon ECS": {
    "name": "Amazon ECS",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Amazon ECS is a highly scalable, high-performance container orchestration service that supports Docker containers and allows you to easily run and scale containerized applications on AWS. ECS eliminates the need to install and operate your own container orchestration software, manage and scale a cluster of virtual machines, or schedule containers on those virtual machines.",
    "properties": {},
    "tags": []
  },
  "Amazon EKS - Elastic Kubernetes Service": {
    "name": "Amazon EKS - Elastic Kubernetes Service",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Amazon Elastic Kubernetes Service (EKS) is a managed Kubernetes service that simplifies running Kubernetes on AWS. It allows you to deploy, manage, and scale containerized applications using Kubernetes. Amazon EKS provides a highly available and secure Kubernetes control plane and handles the cluster operations, including patching, node provisioning, and scaling.",
    "properties": {},
    "tags": []
  },
  "Amazon Auto Scaling": {
    "name": "Amazon Auto Scaling",
    "type": "Auto Scaling Group",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "Amazon Auto Scaling helps you maintain application availability and allows you to automatically add or remove EC2 instances according to conditions you define. You can use Auto Scaling to help ensure that you are running your desired number of instances.",
    "properties": {},
    "tags": []
  },
  "AWS Batch": {
    "name": "AWS Batch",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "AWS Batch enables developers, scientists, and engineers to easily and efficiently run hundreds of thousands of batch computing jobs on AWS. It dynamically provisions the optimal quantity and type of compute resources based on the volume and specific requirements of the batch jobs submitted.",
    "properties": {},
    "tags": []
  },
  "AWS Lambda": {
    "name": "AWS Lambda",
    "type": "Serverless Functions",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "AWS Lambda is a serverless compute service that lets you run code without provisioning or managing servers, creating workload-aware cluster scaling logic, maintaining event integrations, or managing runtimes. With Lambda, you can run code for virtually any type of application or backend service with zero administration. You pay only for the compute time you consume - there is no charge when your code is not running.",
    "properties": {},
    "tags": []
  },
  "EC2": {
    "name": "EC2",
    "type": "Virtual Machines",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "Amazon EC2 is a web service that provides secure, resizable compute capacity in the cloud. It is designed to make web-scale cloud computing easier for developers. EC2's simple web service interface allows you to obtain and configure capacity with minimal friction. It provides you with complete control of your computing resources and lets you run on Amazon’s proven computing environment.",
    "properties": {},
    "tags": []
  },
  "EC2 Reserved Instances": {
    "name": "EC2 Reserved Instances",
    "type": "Virtual Machines",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "EC2 Reserved Instances provide you with a significant discount (up to 75%) compared to On-Demand instance pricing. In addition, they give you the option to reserve instances for a one-year or three-year term. This makes them ideal for applications with steady-state or predictable usage, offering both cost savings and capacity reservation. They can be purchased in three payment options – All upfront, Partial upfront, or No upfront.",
    "properties": {},
    "tags": []
  },
  "EC2 Spot Instances": {
    "name": "EC2 Spot Instances",
    "type": "Virtual Machines",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "EC2 Spot Instances allow you to request spare Amazon EC2 computing capacity for up to 90% off the On-Demand price. Spot Instances are ideal for workloads that are flexible in when and how they run. They enable you to optimize your costs on the AWS cloud and scale your application's throughput up to 10X for the same budget. Since Spot Instances are often available at a discount, they're cost-effective for running large-scale, fault-tolerant workloads.",
    "properties": {},
    "tags": []
  },
  "Amazon ECR": {
    "name": "Amazon ECR",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Amazon ECR is a fully managed Docker container registry that makes it easy for developers to store, manage, and deploy Docker container images. It is integrated with Amazon ECS, simplifying your development to production workflow.",
    "properties": {},
    "tags": []
  },
  "AWS App Mesh": {
    "name": "AWS App Mesh",
    "type": "Service Mesh",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "AWS App Mesh is a service mesh that provides application-level networking for your microservices. It standardizes how your services communicate, giving you end-to-end visibility and ensuring high-availability for your applications.",
    "properties": {},
    "tags": []
  },
  "AWS App Runner": {
    "name": "AWS App Runner",
    "type": "Microservices Management",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "AWS App Runner is a fully managed service that makes it easy for developers to quickly deploy containerized web applications and APIs, at scale and with no prior infrastructure experience required. It automatically builds and deploys the web application and load balances traffic with encryption.",
    "properties": {},
    "tags": []
  },
  "Amazon Aurora": {
    "name": "Amazon Aurora",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "Amazon Aurora is a MySQL and PostgreSQL-compatible relational database built for the cloud. It combines the performance and availability of high-end commercial databases with the simplicity and cost-effectiveness of open-source databases.",
    "properties": {},
    "tags": []
  },
  "Amazon DynamoDB": {
    "name": "Amazon DynamoDB",
    "type": "NoSQL Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "Amazon DynamoDB is a fast and flexible NoSQL database service for any scale. It's a fully managed, multi-region, durable database with built-in security, backup and restore, and in-memory caching for internet-scale applications.",
    "properties": {},
    "tags": []
  },
  "Amazon ElastiCache": {
    "name": "Amazon ElastiCache",
    "type": "In-Memory Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "Amazon ElastiCache offers fully managed Redis and Memcached for the most demanding applications requiring sub-millisecond response times. It’s used for data caching to improve the performance of web applications by retrieving data from fast, managed, in-memory caches.",
    "properties": {},
    "tags": []
  },
  "Amazon QLDB": {
    "name": "Amazon QLDB",
    "type": "Ledger Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "Amazon QLDB is a fully managed ledger database that provides a transparent, immutable, and cryptographically verifiable transaction log ‎owned by a central trusted authority.",
    "properties": {},
    "tags": []
  },
  "Amazon RDS": {
    "name": "Amazon RDS",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "Amazon RDS makes it easy to set up, operate, and scale a relational database in the cloud. It provides cost-efficient and resizable capacity, automating time-consuming administration tasks such as hardware provisioning, database setup, patching, and backups.",
    "properties": {},
    "tags": []
  },
  "Amazon Redshift": {
    "name": "Amazon Redshift",
    "type": "Data Warehouse",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "Amazon Redshift is a fast, scalable data warehouse that makes it simple and cost-effective to analyze all your data across your data warehouse and data lake. It allows running complex queries and obtaining insights for data-driven decision-making.",
    "properties": {},
    "tags": []
  },
  "Amazon Timestream": {
    "name": "Amazon Timestream",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "Amazon Timestream is a fast, scalable, and serverless time series database service for IoT and operational applications. It makes it easy to store and analyze trillions of events per day at 1/10th the cost of relational databases.",
    "properties": {},
    "tags": []
  },
  "AWS Cloud9": {
    "name": "AWS Cloud9",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS Cloud9 is a cloud-based integrated development environment (IDE) that lets you write, run, and debug your code with just a browser. It includes a code editor, debugger, and terminal. Cloud9 comes pre-packaged with essential tools for popular programming languages and the AWS Command Line Interface (CLI) pre-installed, so you don’t need to install files or configure your development machine to start new projects.",
    "properties": {},
    "tags": []
  },
  "AWS CloudFormation": {
    "name": "AWS CloudFormation",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS CloudFormation provides a common language for you to describe and provision all the infrastructure resources in your cloud environment. CloudFormation allows you to use a simple text file to model and provision, in an automated and secure manner, all the resources needed for your applications across all regions and accounts.",
    "properties": {},
    "tags": []
  },
  "AWS CodeBuild": {
    "name": "AWS CodeBuild",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS CodeBuild is a fully managed continuous integration service that compiles source code, runs tests, and produces software packages that are ready to deploy. It scales continuously and processes multiple builds concurrently, eliminating the need to manage and scale your own build servers.",
    "properties": {},
    "tags": []
  },
  "AWS CodeCommit": {
    "name": "AWS CodeCommit",
    "type": "Code Repositories",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS CodeCommit is a fully-managed source control service that hosts secure Git-based repositories. It makes it easy for teams to collaborate on code with secure and highly scalable repositories. CodeCommit eliminates the need to operate your own source control system or worry about scaling its infrastructure.",
    "properties": {},
    "tags": []
  },
  "AWS CodeDeploy": {
    "name": "AWS CodeDeploy",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS CodeDeploy is a service that automates code deployments to any instance, including Amazon EC2 instances and on-premises servers. It makes it easier for you to rapidly release new features, helps avoid downtime during application deployment, and handles the complexity of updating your applications.",
    "properties": {},
    "tags": []
  },
  "AWS CodePipeline": {
    "name": "AWS CodePipeline",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS CodePipeline is a continuous integration and continuous delivery service that helps you automate your release pipelines for fast and reliable application and infrastructure updates. CodePipeline automates the build, test, and deploy phases of your release process every time there is a code change, based on the release model you define.",
    "properties": {},
    "tags": []
  },
  "AWS X-Ray": {
    "name": "AWS X-Ray",
    "type": "Application Performance Monitoring",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS X-Ray helps developers analyze and debug production, distributed applications, such as those built using a microservices architecture. With X-Ray, you can understand how your application and its underlying services are performing to identify and troubleshoot the root cause of performance issues and errors.",
    "properties": {},
    "tags": []
  },
  "AWS IoT Analytics": {
    "name": "AWS IoT Analytics",
    "type": "IoT Analytics",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "AWS IoT Analytics is a fully managed service that makes it easy to run sophisticated analytics on massive volumes of IoT data without having to worry about the cost and complexity typically required to build an IoT analytics platform.",
    "properties": {},
    "tags": []
  },
  "AWS IoT Core": {
    "name": "AWS IoT Core",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "AWS IoT Core is a managed cloud service that lets connected devices easily and securely interact with cloud applications and other devices. AWS IoT Core can support billions of devices and trillions of messages, and can process and route those messages to AWS endpoints and to other devices reliably and securely.",
    "properties": {},
    "tags": []
  },
  "AWS IoT Device Defender": {
    "name": "AWS IoT Device Defender",
    "type": "IoT Security",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "AWS IoT Device Defender is a fully managed service that helps you secure your fleet of IoT devices. It continuously audits your IoT configurations to ensure they aren’t deviating from security best practices and detects abnormal behavior to mitigate security risks.",
    "properties": {},
    "tags": []
  },
  "AWS IoT Greengrass": {
    "name": "AWS IoT Greengrass",
    "type": "IoT Data Collection",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "AWS IoT Greengrass seamlessly extends AWS to edge devices so they can act locally on the data they generate, while still using the cloud for management, analytics, and durable storage. It allows you to run AWS Lambda functions, Docker containers, or your own code on connected devices in a secure and scalable way.",
    "properties": {},
    "tags": []
  },
  "AWS IoT Things Graph": {
    "name": "AWS IoT Things Graph",
    "type": "IoT Platforms",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "AWS IoT Things Graph is a service that makes it easy to visually connect different devices and web services to build IoT applications. It provides a visual drag-and-drop interface for connecting and coordinating interactions between devices and web services, so you can build IoT applications quickly.",
    "properties": {},
    "tags": []
  },
  "Amazon Comprehend": {
    "name": "Amazon Comprehend",
    "type": "Natural Language Processing",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "Amazon Comprehend is a natural language processing (NLP) service that uses machine learning to find insights and relationships in text. It can identify the language of the text, extract key phrases, places, people, brands, or events, understand sentiment, and more.",
    "properties": {},
    "tags": []
  },
  "Amazon Forecast": {
    "name": "Amazon Forecast",
    "type": "Predictive Analytics",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "Amazon Forecast is a fully managed service that uses machine learning to deliver highly accurate forecasts. It is based on the same technology used at Amazon.com, and it requires no machine learning experience to get started. It can forecast business conditions, such as product demand, inventory levels, or energy needs.",
    "properties": {},
    "tags": []
  },
  "Amazon Rekognition": {
    "name": "Amazon Rekognition",
    "type": "Computer Vision",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "Amazon Rekognition is a service that makes it easy to add image and video analysis to your applications. It can identify objects, people, text, scenes, and activities in images and videos, as well as detect any inappropriate content.",
    "properties": {},
    "tags": []
  },
  "Amazon SageMaker Autopilot": {
    "name": "Amazon SageMaker Autopilot",
    "type": "Automated Machine Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "Amazon SageMaker Autopilot is an automated machine learning (AutoML) service that automatically creates the best machine learning models for your data while allowing you to maintain full control and visibility. It simplifies the process of building, training, and deploying machine learning models based on your data.",
    "properties": {},
    "tags": []
  },
  "Amazon SageMaker Ground Truth": {
    "name": "Amazon SageMaker Ground Truth",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "Amazon SageMaker Ground Truth is a fully managed data labeling service that makes it easy to build highly accurate training datasets for machine learning. It offers easy-to-use interfaces for labeling different types of data, such as images, text, and videos, and integrates seamlessly with Amazon SageMaker to help improve the quality of machine learning models.",
    "properties": {},
    "tags": []
  },
  "Amazon SageMaker RL": {
    "name": "Amazon SageMaker RL",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "Amazon SageMaker RL (Reinforcement Learning) is a managed service that simplifies the process of building, training, and deploying reinforcement learning models. It integrates with simulation environments and offers flexible interfaces for managing the RL training lifecycle.",
    "properties": {},
    "tags": []
  },
  "Amazon Transcribe": {
    "name": "Amazon Transcribe",
    "type": "Speech Recognition",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "Amazon Transcribe is an automatic speech recognition (ASR) service that makes it easy for developers to add speech-to-text capability to their applications. It can be used to transcribe customer service calls, automate subtitling, and convert spoken content into text.",
    "properties": {},
    "tags": []
  },
  "AWS Audit Manager": {
    "name": "AWS Audit Manager",
    "type": "Compliance Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "AWS Audit Manager helps you continuously audit your AWS usage to simplify how you assess risk and compliance with regulations and industry standards. It automates evidence collection to make it easier to manage audits of your AWS environment, enabling you to scale your audit capability as your AWS environment grows.",
    "properties": {},
    "tags": []
  },
  "AWS Compute Optimizer": {
    "name": "AWS Compute Optimizer",
    "type": "Resource Optimization",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "AWS Compute Optimizer offers recommendations for optimal AWS resources for your workloads to reduce costs and improve performance by using machine learning to analyze historical utilization metrics.",
    "properties": {},
    "tags": []
  },
  "AWS Config": {
    "name": "AWS Config",
    "type": "Infrastructure Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "AWS Config is a service that enables you to assess, audit, and evaluate the configurations of your AWS resources. It continuously monitors and records your AWS resource configurations and allows you to automate the evaluation of recorded configurations against desired configurations.",
    "properties": {},
    "tags": []
  },
  "AWS OpsWorks": {
    "name": "AWS OpsWorks",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "AWS OpsWorks is a configuration management service that provides managed instances of Chef and Puppet. OpsWorks lets you use Chef and Puppet to automate how servers are configured, deployed, and managed across your Amazon EC2 instances or on-premises compute environments.",
    "properties": {},
    "tags": []
  },
  "AWS Service Catalog": {
    "name": "AWS Service Catalog",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "AWS Service Catalog allows organizations to create and manage catalogs of IT services that are approved for use on AWS. This helps organizations to achieve consistent governance and meet compliance requirements, while enabling users to quickly deploy only the approved IT services they need.",
    "properties": {},
    "tags": []
  },
  "AWS Application Discovery Service": {
    "name": "AWS Application Discovery Service",
    "type": "Application Migration Tools",
    "classification": "Migration and Transfer Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/migration.svg",
    "description": "AWS Application Discovery Service helps enterprise customers plan migration projects by gathering information about their on-premises data centers. It collects and presents configuration, usage, and behavior data from your servers to help you better understand your workloads.",
    "properties": {},
    "tags": []
  },
  "AWS Database Migration Service": {
    "name": "AWS Database Migration Service",
    "type": "Data Migration Services",
    "classification": "Migration and Transfer Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/migration.svg",
    "description": "AWS Database Migration Service helps you migrate databases to AWS quickly and securely. The source database remains fully operational during the migration, minimizing downtime to applications. It supports both homogeneous migrations such as Oracle to Oracle, and heterogeneous migrations between different database platforms, like Oracle to Amazon Aurora.",
    "properties": {},
    "tags": ["Database Migration Services"]
  },
  "AWS Snow Family": {
    "name": "AWS Snow Family",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "The AWS Snow Family helps you physically transport terabytes to exabytes of data into and out of AWS. This service is used for data migration, content distribution, and edge computing. It includes AWS Snowcone, Snowball, and Snowmobile, catering to different scales of data transfer needs.",
    "properties": {},
    "tags": []
  },
  "AWS Snowball": {
    "name": "AWS Snowball",
    "type": "Offline Data Transfer Services",
    "classification": "Migration and Transfer Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/migration.svg",
    "description": "AWS Snowball is a data transport solution that uses secure, rugged devices to transfer large amounts of data into and out of the AWS cloud. It addresses challenges like high network costs, long transfer times, and security concerns.",
    "properties": {},
    "tags": []
  },
  "AWS Transfer Family": {
    "name": "AWS Transfer Family",
    "type": "Online Data Transfer Services",
    "classification": "Migration and Transfer Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/migration.svg",
    "description": "AWS Transfer Family provides fully managed support for file transfers directly into and out of Amazon S3 or Amazon EFS. With support for Secure File Transfer Protocol (SFTP), File Transfer Protocol over SSL (FTPS), and File Transfer Protocol (FTP), the AWS Transfer Family helps migrate file transfer workflows to AWS.",
    "properties": {},
    "tags": []
  },
  "Amazon CloudFront": {
    "name": "Amazon CloudFront",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Amazon CloudFront is a fast content delivery network (CDN) service that securely delivers data, videos, applications, and APIs to customers globally with low latency and high transfer speeds.",
    "properties": {},
    "tags": []
  },
  "Amazon CloudWatch": {
    "name": "Amazon CloudWatch",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Amazon CloudWatch is a monitoring and observability service built for DevOps engineers, developers, site reliability engineers (SREs), and IT managers. It provides data and actionable insights to monitor applications, respond to system-wide performance changes, optimize resource utilization, and get a unified view of operational health.",
    "properties": {},
    "tags": []
  },
  "Amazon Route 53": {
    "name": "Amazon Route 53",
    "type": "DNS Management",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Amazon Route 53 is a highly available and scalable cloud Domain Name System (DNS) web service, designed to give developers and businesses an extremely reliable and cost-effective way to route end users to Internet applications.",
    "properties": {},
    "tags": []
  },
  "Amazon VPC": {
    "name": "Amazon VPC",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Amazon VPC lets you provision a logically isolated section of the AWS Cloud where you can launch AWS resources in a virtual network that you define. It gives complete control over your virtual networking environment, including resource placement, connectivity, and security.",
    "properties": {},
    "tags": []
  },
  "AWS Subnet": {
    "name": "AWS Subnet",
    "type": "Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "AWS Subnets are segments of a VPC’s IP address range where you can place groups of isolated resources. They allow you to partition your network inside a VPC to manage and secure resources effectively.",
    "properties": {},
    "tags": []
  },
  "AWS Security Group": {
    "name": "AWS Security Group",
    "type": "Network Security",
    "classification": "Security Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS Security Groups act as virtual firewalls that control inbound and outbound traffic for AWS resources. They provide a way to set rules that filter traffic based on IP address, protocol, and port.",
    "properties": {},
    "tags": []
  },
  "AWS Direct Connect": {
    "name": "AWS Direct Connect",
    "type": "Direct Connect",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "AWS Direct Connect is a cloud service solution that makes it easy to establish a dedicated network connection from your premises to AWS. It can reduce network costs, increase bandwidth throughput, and provide a more consistent network experience than internet-based connections.",
    "properties": {},
    "tags": []
  },
  "AWS Network Firewall": {
    "name": "AWS Network Firewall",
    "type": "Firewall Services",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "AWS Network Firewall is a managed service that makes it easy to deploy essential network protections for all of your Amazon VPCs. It provides flexible rules for network traffic filtering, intrusion detection and prevention, and web filtering",
    "properties": {},
    "tags": []
  },
  "AWS VPC Flow Logs": {
    "name": "AWS VPC Flow Logs",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "AWS VPC Flow Logs capture information about the IP traffic going to and from network interfaces in your VPC. This feature allows you to monitor and troubleshoot connectivity issues, understand network traffic patterns, and keep a secure environment.",
    "properties": {},
    "tags": []
  },
  "AWS VPN": {
    "name": "AWS VPN",
    "type": "VPN Services",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "AWS VPN enables you to securely connect your on-premises network or branch office site to your Amazon Virtual Private Cloud (VPC). It provides two types of VPN connections, Site-to-Site VPN and Client VPN.",
    "properties": {},
    "tags": []
  },
  "Elastic Load Balancing (ELB)": {
    "name": "Elastic Load Balancing (ELB)",
    "type": "Load Balancer",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Elastic Load Balancing automatically distributes incoming application traffic across multiple targets, such as Amazon EC2 instances, containers, and IP addresses. It can handle varying load of your application traffic in a single Availability Zone or across multiple Availability Zones.",
    "properties": {},
    "tags": []
  },
  "Amazon Braket": {
    "name": "Amazon Braket",
    "type": "Quantum-as-a-Service",
    "classification": "Quantum Computing",
    "iconUrl": null,
    "description": "Amazon Braket is a fully managed quantum computing service that helps researchers and developers get started with the field of quantum computing. It provides a development environment to explore and design quantum algorithms, test them on simulated quantum computers, and run them on different types of quantum computing hardware.",
    "properties": {},
    "tags": ["Quantum Algorithms", "Quantum Simulators", "Quantum-as-a-Service"]
  },
  "AWS Key Management Service": {
    "name": "AWS Key Management Service",
    "type": "Quantum Cryptography",
    "classification": "Quantum Computing",
    "iconUrl": null,
    "description": "AWS Key Management Service is a managed service that makes it easy for you to create and control the cryptographic keys used to secure your data. The service is integrated with other AWS services and external applications to help you protect the data you store in these services.",
    "properties": {},
    "tags": []
  },
  "Amazon Cognito": {
    "name": "Amazon Cognito",
    "type": "Authentication Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "Amazon Cognito provides authentication, authorization, and user management for your web and mobile apps. It allows users to sign in directly with a user name and password or through a third party such as Facebook, Amazon, Google, or Apple.",
    "properties": {},
    "tags": []
  },
  "Amazon Detective": {
    "name": "Amazon Detective",
    "type": "Security Information and Event Management",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "Amazon Detective makes it easy to analyze, investigate, and quickly identify the root cause of potential security issues or suspicious activities.",
    "properties": {},
    "tags": []
  },
  "AWS Directory Service": {
    "name": "AWS Directory Service",
    "type": "Directory Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS Directory Service provides multiple ways to use Amazon Cloud Directory and Microsoft Active Directory with other AWS services. It offers directory services that are fully managed and can be used to establish a standalone directory in the AWS Cloud.",
    "properties": {},
    "tags": []
  },
  "AWS GuardDuty": {
    "name": "AWS GuardDuty",
    "type": "Intrusion Detection and Prevention",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS GuardDuty is a threat detection service that continuously monitors for malicious or unauthorized behavior to help you protect your AWS accounts and workloads.",
    "properties": {},
    "tags": []
  },
  "AWS IAM": {
    "name": "AWS IAM",
    "type": "Identity and Access Management",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS IAM enables you to manage access to AWS services and resources securely. It allows you to create and manage AWS users and groups and use permissions to allow and deny their access to AWS resources.",
    "properties": {},
    "tags": []
  },
  "AWS IAM Roles and Policies": {
    "name": "AWS IAM Roles and Policies",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS IAM Roles and Policies provide a secure way to delegate access to users or services. Roles are used to define a set of permissions for making AWS service requests. Policies attached to roles define the actions that can be performed on resources.",
    "properties": {},
    "tags": []
  },
  "AWS Key Management Service (KMS)": {
    "name": "AWS Key Management Service (KMS)",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS Key Management Service (KMS) is a managed service that makes it easy for you to create and control the cryptographic keys used to secure your data. KMS is integrated with other AWS services making it easy to encrypt data you store in these services.",
    "properties": {},
    "tags": []
  },
  "AWS Security Hub": {
    "name": "AWS Security Hub",
    "type": "Security Information and Event Management",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS Security Hub gives you a comprehensive view of your high-priority security alerts and compliance status across AWS accounts.",
    "properties": {},
    "tags": []
  },
  "AWS Shield": {
    "name": "AWS Shield",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS Shield is a managed Distributed Denial of Service (DDoS) protection service that safeguards applications running on AWS. It provides always-on detection and automatic inline mitigations to minimize application downtime and latency.",
    "properties": {},
    "tags": []
  },
  "AWS WAF": {
    "name": "AWS WAF",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "AWS WAF is a web application firewall that helps protect your web applications or APIs against common web exploits and bots that may affect availability, compromise security, or consume excessive resources.",
    "properties": {},
    "tags": []
  },
  "Amazon EBS": {
    "name": "Amazon EBS",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Amazon EBS is a high-performance block storage service designed for use with Amazon EC2 for both throughput and transaction-intensive workloads at any scale. It offers a range of options for storage performance and cost, and is well-suited for applications such as databases, ERP systems, and big data analytics.",
    "properties": {},
    "tags": []
  },
  "Amazon EFS": {
    "name": "Amazon EFS",
    "type": "File Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Amazon EFS provides a simple, scalable, fully managed elastic NFS file system for use with AWS Cloud services and on-premises resources. It is built to scale on demand to petabytes without disrupting applications, growing and shrinking automatically as you add and remove files.",
    "properties": {},
    "tags": []
  },
  "Amazon FSx": {
    "name": "Amazon FSx",
    "type": "File Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Amazon FSx provides fully managed third-party file systems with the native compatibility and feature sets for workloads such as Windows-based storage, high-performance computing, machine learning, and electronic design automation.",
    "properties": {},
    "tags": []
  },
  "Amazon S3": {
    "name": "Amazon S3",
    "type": "Object Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Amazon S3 is an object storage service that offers industry-leading scalability, data availability, security, and performance. It is designed for a wide range of storage solutions, including backup and recovery, data archives, data lakes, and cloud-native applications.",
    "properties": {},
    "tags": []
  },
  "Amazon S3 Glacier": {
    "name": "Amazon S3 Glacier",
    "type": "Object Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Amazon S3 Glacier is a secure, durable, and extremely low-cost cloud storage service for data archiving and long-term backup. It is optimized for infrequently accessed data where retrieval time of several hours is suitable.",
    "properties": {},
    "tags": []
  },
  "Amazon S3 Glacier Deep Archive": {
    "name": "Amazon S3 Glacier Deep Archive",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Amazon S3 Glacier Deep Archive is the lowest-cost storage service from AWS, designed for long-term preservation of data that is accessed infrequently. It's suitable for archiving data that may be needed once a year or less, offering the security and durability of Amazon S3 for long-term data retention.",
    "properties": {},
    "tags": []
  },
  "AWS Storage Gateway": {
    "name": "AWS Storage Gateway",
    "type": "Hybrid Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "AWS Storage Gateway is a hybrid cloud storage service that gives you on-premises access to virtually unlimited cloud storage. It can be used for backup and archiving, disaster recovery, cloud data processing, storage tiering, and migration. It provides seamless integration between your local environment and AWS's storage infrastructure.",
    "properties": {},
    "tags": []
  },
  "Amazon Region": {
    "name": "Amazon Region",
    "type": "Region",
    "classification": "Region",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/node.svg",
    "description": "An AWS Region is a physical location in the world where AWS has multiple data centers. Each Region consists of multiple Availability Zones, which are isolated locations within the Region. AWS Regions are designed to provide low-latency, high-availability, and fault-tolerant infrastructure for your applications.",
    "properties": {},
    "tags": []
  },
  "AWS Account": {
    "name": "AWS Account",
    "type": "Account",
    "classification": "Account",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/node.svg",
    "description": "An AWS account is a container for your AWS resources. It includes the information you use to access AWS, the resources you create, and the billing information for those resources. You can have multiple AWS accounts, each with its own resources and settings.",
    "properties": {},
    "tags": []
  },
  "Node": {
    "name": "Node",
    "type": "Unknown",
    "classification": "Unknown",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/node.svg",
    "description": "A component that Catio was unable to classify.",
    "properties": {},
    "tags": []
  },
  "Console": {
    "name": "Console",
    "type": "Interface",
    "classification": "Interface",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/console.svg",
    "description": "A user interface component.",
    "properties": {},
    "tags": []
  },
  "Desktop": {
    "name": "Desktop",
    "type": "Interface",
    "classification": "Interface",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/desktop.svg",
    "description": "A user interface component.",
    "properties": {},
    "tags": []
  },
  "Mobile": {
    "name": "Mobile",
    "type": "Interface",
    "classification": "Interface",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/mobile.svg",
    "description": "A user interface component.",
    "properties": {},
    "tags": []
  },
  "Person": {
    "name": "Person",
    "type": "Human",
    "classification": "Huuman",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/person.svg",
    "description": "A person interacting with or being notified by the system. Not a cat.",
    "properties": {},
    "tags": []
  },
  "System": {
    "name": "System",
    "type": "System",
    "classification": "System",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/system.svg",
    "description": "Another software system, either internal or external.",
    "properties": {},
    "tags": []
  },
  "Analytics Services": {
    "name": "Analytics Services",
    "type": "Analytics Services",
    "classification": "Analytics Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/analytics.svg",
    "description": "AWS Analytics Services provide tools for processing and analyzing large datasets to help businesses gain insights and make data-driven decisions. Services include Amazon EMR for big data processing, Amazon Redshift for data warehousing, and Amazon Kinesis for real-time data streaming.",
    "properties": {},
    "tags": []
  },
  "Machine Learning and AI Services": {
    "name": "Machine Learning and AI Services",
    "type": "Machine Learning and AI Services",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai.svg",
    "description": "AWS offers a range of services to build, train, and deploy machine learning models and artificial intelligence applications. This includes Amazon SageMaker for model building, Amazon Rekognition for image and video analysis, and AWS DeepLens for deep learning-enabled video cameras.",
    "properties": {},
    "tags": []
  },
  "Application Integration": {
    "name": "Application Integration",
    "type": "Application Integration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "These services enable different applications, systems, and data to work together within the cloud or across on-premises environments. Examples include AWS Step Functions for workflow automation and Amazon SNS for pub/sub messaging.",
    "properties": {},
    "tags": []
  },
  "Blockchain": {
    "name": "Blockchain",
    "type": "Blockchain",
    "classification": "Blockchain",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/blockchain.svg",
    "description": "AWS provides services to create and manage scalable blockchain networks and ledgers for applications where multiple parties need to execute transactions without a central authority. Amazon Managed Blockchain supports popular blockchain frameworks.",
    "properties": {},
    "tags": [
      "Smart Contracts",
      "Decentralized Applications",
      "Consensus Services",
      "Blockchain Networks"
    ]
  },
  "Compute Services": {
    "name": "Compute Services",
    "type": "Compute Services",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "AWS Compute Services offer a range of computing power options to run applications, including Amazon EC2 for scalable virtual servers, AWS Lambda for serverless computing, and AWS Elastic Beanstalk for deploying applications.",
    "properties": {},
    "tags": []
  },
  "Containers and Orchestration": {
    "name": "Containers and Orchestration",
    "type": "Containers and Orchestration",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "These services help manage and deploy containers at scale, including Amazon ECS for container management, Amazon EKS for Kubernetes orchestration, and AWS Fargate for serverless container execution.",
    "properties": {},
    "tags": []
  },
  "Database Services": {
    "name": "Database Services",
    "type": "Database Services",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "AWS provides fully managed relational and NoSQL database services. Examples include Amazon RDS for relational databases, Amazon DynamoDB for NoSQL databases, and Amazon Aurora for high-performance database needs.",
    "properties": {},
    "tags": []
  },
  "Developer Tools": {
    "name": "Developer Tools",
    "type": "Developer Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "AWS offers a set of tools for developers to code, build, and deploy applications. This includes AWS CodeBuild, AWS CodeDeploy, and AWS CodePipeline for continuous integration and delivery.'",
    "properties": {},
    "tags": []
  },
  "IoT": {
    "name": "IoT",
    "type": "IoT",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "AWS IoT services allow the connection and management of IoT devices to the cloud, enabling secure data collection, processing, and analysis. Services include AWS IoT Core and AWS IoT Analytics.",
    "properties": {},
    "tags": []
  },
  "Management and Monitoring": {
    "name": "Management and Monitoring",
    "type": "Management and Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "These services provide tools to monitor and manage AWS resources, application performance, and operational health. Examples include Amazon CloudWatch for monitoring and AWS CloudFormation for infrastructure as code.'",
    "properties": {},
    "tags": []
  },
  "Migration and Transfer Services": {
    "name": "Migration and Transfer Services",
    "type": "Migration and Transfer Services",
    "classification": "Migration and Transfer Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/migration.svg",
    "description": "AWS offers services for migrating applications, data, and workloads to the cloud. This includes AWS Migration Hub for tracking migrations and AWS DataSync for data transfer.",
    "properties": {},
    "tags": []
  },
  "Networking Services": {
    "name": "Networking Services",
    "type": "Networking Services",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "AWS provides a range of networking services to connect cloud resources, secure network architecture, and deliver content. This includes Amazon VPC for isolated network environments, Amazon Route 53 for DNS services, and AWS Direct Connect for dedicated network connections.",
    "properties": {},
    "tags": []
  },
  "Quantum Computing": {
    "name": "Quantum Computing",
    "type": "Quantum Computing",
    "classification": "Quantum Computing",
    "iconUrl": null,
    "description": "AWS offers services to explore and experiment with quantum computing through Amazon Braket, which provides a development environment to build quantum algorithms.",
    "properties": {},
    "tags": ["Quantum Algorithms", "Quantum Simulators", "Quantum-as-a-Service"]
  },
  "Security and Identity Services": {
    "name": "Security and Identity Services",
    "type": "Security and Identity Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security.svg",
    "description": "These services help secure AWS applications and resources, manage user authentication and authorization. Examples include AWS Identity and Access Management (IAM) and Amazon Cognito.",
    "properties": {},
    "tags": []
  },
  "Storage Services": {
    "name": "Storage Services",
    "type": "Storage Services",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_services.svg",
    "description": "AWS offers scalable storage solutions for data backup, archival, and recovery. This includes Amazon S3 for object storage, Amazon EBS for block storage, and Amazon Glacier for long-term archival storage.",
    "properties": {},
    "tags": []
  },
  "MuleSoft Anypoint Platform": {
    "name": "MuleSoft Anypoint Platform",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "An API-led integration platform that includes a visual orchestration engine for designing, building, and managing data and application integrations.",
    "properties": {},
    "tags": []
  },
  "IBM Integration Bus": {
    "name": "IBM Integration Bus",
    "type": "Enterprise Service Bus",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "A powerful ESB solution that enables rapid integration of applications and data across multiple platforms, including on-premises and cloud environments.",
    "properties": {},
    "tags": []
  },
  "WSO2 Enterprise Integrator": {
    "name": "WSO2 Enterprise Integrator",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "An open-source integration platform that includes an orchestration engine for managing and orchestrating data and services across cloud and on-premises applications.",
    "properties": {},
    "tags": []
  },
  "Red Hat JBoss Fuse": {
    "name": "Red Hat JBoss Fuse",
    "type": "Enterprise Service Bus",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A lightweight, flexible, and modular ESB that helps businesses integrate applications and services across diverse environments.",
    "properties": {},
    "tags": []
  },
  "TIBCO BusinessWorks": {
    "name": "TIBCO BusinessWorks",
    "type": "Enterprise Service Bus",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "An enterprise-grade ESB that enables businesses to integrate applications, data, and devices in a unified manner, with built-in support for popular protocols and messaging standards.",
    "properties": {},
    "tags": []
  },
  "Dell Boomi": {
    "name": "Dell Boomi",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A low-code integration platform that includes a powerful orchestration engine for managing complex data flows and workflows across cloud and on-premises applications.",
    "properties": {},
    "tags": []
  },
  "Talend Data Fabric": {
    "name": "Talend Data Fabric",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A unified data integration and management platform that includes a powerful orchestration engine for managing and monitoring data workflows and pipelines.",
    "properties": {},
    "tags": []
  },
  "Software AG webMethods": {
    "name": "Software AG webMethods",
    "type": "Enterprise Service Bus",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "A comprehensive integration platform that combines ESB, API management, B2B integration, and IoT capabilities to support a wide range of integration scenarios.",
    "properties": {},
    "tags": []
  },
  "Tavant V'Enovia": {
    "name": "Tavant V'Enovia",
    "type": "Enterprise Service Bus",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "A cloud-based ESB that enables businesses to connect applications, data sources, and devices in real-time, with support for popular protocols and message formats.",
    "properties": {},
    "tags": []
  },
  "Axway AMPLIFY": {
    "name": "Axway AMPLIFY",
    "type": "Enterprise Service Bus",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "A hybrid integration platform that provides ESB capabilities, API management, EDI/B2B integration, and file transfer to support diverse integration patterns and use cases.",
    "properties": {},
    "tags": []
  },
  "Cloudify": {
    "name": "Cloudify",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "Cloudify is an open source cloud orchestration platform designed to help users automate and manage workflows across multiple cloud environments. It offers features such as infrastructure as code, self-service portal, and application lifecycle management.",
    "properties": {},
    "tags": []
  },
  "ServiceNow": {
    "name": "ServiceNow",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "ServiceNow is a cloud-based IT service management platform that also offers workflow orchestration capabilities. It allows users to automate processes, create workflows, and integrate with third-party tools for enhanced functionality.",
    "properties": {},
    "tags": []
  },
  "Datadog": {
    "name": "Datadog",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This monitoring and analytics platform offers full visibility into your AWS infrastructure, applications, and logs, allowing you to identify and resolve issues quickly.",
    "properties": {},
    "tags": []
  },
  "Morpheus": {
    "name": "Morpheus",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "Morpheus is a multi-cloud management platform that includes workflow orchestration capabilities. It allows users to automate tasks, manage cloud resources, and streamline workflows across various cloud environments.",
    "properties": {},
    "tags": []
  },
  "StackStorm": {
    "name": "StackStorm",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "StackStorm is an open source event-driven automation platform that offers workflow orchestration features. It allows users to create workflows, automate tasks, and integrate with various tools and services for enhanced automation.",
    "properties": {},
    "tags": []
  },
  "Apache Airflow": {
    "name": "Apache Airflow",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A popular open-source orchestration engine for managing workflows and data pipelines. It allows users to define, schedule, and monitor complex workflows using Python scripts.",
    "properties": {},
    "tags": []
  },
  "BMC Control-M": {
    "name": "BMC Control-M",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "BMC Control-M is a workload automation platform that includes workflow orchestration capabilities. It allows users to schedule, monitor, and manage workflows across on-premise, cloud, and hybrid environments.",
    "properties": {},
    "tags": []
  },
  "IBM App Connect": {
    "name": "IBM App Connect",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "IBM App Connect is a cloud-based integration platform that also offers workflow orchestration features. It allows users to build and automate workflows, as well as integrate with various applications and services.",
    "properties": {},
    "tags": []
  },
  "Red Hat Ansible Automation Platform": {
    "name": "Red Hat Ansible Automation Platform",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "Red Hat Ansible Automation Platform is an open source automation platform that also offers workflow orchestration capabilities. It allows users to create and manage complex workflows, as well as integrate with other tools and services.",
    "properties": {},
    "tags": []
  },
  "Micro Focus Operations Orchestration": {
    "name": "Micro Focus Operations Orchestration",
    "type": "Workflow Orchestration",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "Micro Focus Operations Orchestration is an IT process automation platform that also offers workflow orchestration features. It allows users to design, automate, and monitor workflows across various IT operations.",
    "properties": {},
    "tags": []
  },
  "Talend Big Data Platform": {
    "name": "Talend Big Data Platform",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data integration and management platform that allows users to easily load, extract, and transform large volumes of data using a drag-and-drop interface.",
    "properties": {},
    "tags": []
  },
  "Informatica PowerCenter": {
    "name": "Informatica PowerCenter",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data integration tool that enables organizations to extract, transform, and load data from multiple sources and systems, enabling advanced analytics and business insights.",
    "properties": {},
    "tags": []
  },
  "Alteryx Designer": {
    "name": "Alteryx Designer",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data preparation and analytics platform that helps users blend, cleanse, and analyze data from various sources, making it easier to create and run batch processes for data-driven decision-making.",
    "properties": {},
    "tags": []
  },
  "Matillion ETL": {
    "name": "Matillion ETL",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A cloud-native data integration and transformation tool that leverages Amazon Redshift to enable organizations to load and transform data from various sources into a data warehouse for advanced analytics.",
    "properties": {},
    "tags": []
  },
  "Attunity Replicate": {
    "name": "Attunity Replicate",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data replication and integration tool that automates the process of moving and syncing data between databases, data warehouses, and other cloud platforms, providing real-time data updates.",
    "properties": {},
    "tags": []
  },
  "Trifacta Wrangler Enterprise": {
    "name": "Trifacta Wrangler Enterprise",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data preparation and transformation tool that allows users to easily clean, structure, and enrich large datasets for use in analytics and machine learning applications.",
    "properties": {},
    "tags": []
  },
  "StreamSets Data Collector": {
    "name": "StreamSets Data Collector",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data ingestion and processing tool that enables organizations to efficiently collect, transform, and deliver data in real-time from various sources to data lakes and data warehouses.",
    "properties": {},
    "tags": []
  },
  "Syncsort DMX-h": {
    "name": "Syncsort DMX-h",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data integration and ETL tool that helps organizations extract, transform, and load data from multiple sources into data lakes and data warehouses for advanced analytics and reporting.",
    "properties": {},
    "tags": []
  },
  "SnapLogic Enterprise Integration Cloud": {
    "name": "SnapLogic Enterprise Integration Cloud",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A data integration and API management platform that allows organizations to easily connect and integrate data from various sources, applications, and systems for real-time analytics and insights.",
    "properties": {},
    "tags": []
  },
  "HVR": {
    "name": "HVR",
    "type": "Batch Processing",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A real-time data integration and replication tool that enables organizations to continuously move and synchronize data between databases, data warehouses, and cloud platforms, enabling real-time analytics and decision-making.",
    "properties": {},
    "tags": []
  },
  "Kubernetes Namespace": {
    "name": "Kubernetes Namespace",
    "type": "Namespace",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A Kubernetes Namespace provides a mechanism for isolating groups of resources within a single cluster.",
    "properties": {},
    "tags": ["Kubernetes", "Namespace", "Isolation"]
  },
  "Kubernetes Persistent Volume Claim": {
    "name": "Kubernetes Persistent Volume Claim",
    "type": "Volume Claim",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A Kubernetes Volume is a directory accessible to containers in a pod, used to store data.",
    "properties": {},
    "tags": ["Kubernetes", "Volume", "Storage"]
  },
  "Kubernetes Persistent Volume": {
    "name": "Kubernetes Persistent Volume",
    "type": "Volume",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A Kubernetes Volume is a directory accessible to containers in a pod, used to store data.",
    "properties": {},
    "tags": ["Kubernetes", "Volume", "Storage"]
  },
  "Kubernetes Service Account": {
    "name": "Kubernetes Service Account",
    "type": "ServiceAccount",
    "classification": "Security and Identity",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A Kubernetes Service Account provides an identity for processes running in a Pod to access the Kubernetes API.",
    "properties": {},
    "tags": ["Kubernetes", "Service Account", "Identity"]
  },
  "Kubernetes Deployment": {
    "name": "Kubernetes Deployment",
    "type": "Container Orchestration",
    "classification": "Application Management",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Kubernetes Deployments provide declarative updates for Pods and ReplicaSets. They help automate the deployment, scaling, and management of containerized applications, ensuring they are running smoothly and efficiently.",
    "properties": {},
    "tags": []
  },
  "Kubernetes StatefulSet": {
    "name": "Kubernetes StatefulSet",
    "type": "Container Orchestration",
    "classification": "Application Management",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Kubernetes StatefulSets manage the deployment and scaling of a set of Pods, and provide guarantees about the ordering and uniqueness of these Pods. They are specifically designed for stateful applications requiring persistent storage and consistent network identities.",
    "properties": {},
    "tags": []
  },
  "Kubernetes Service": {
    "name": "Kubernetes Service",
    "type": "Container Orchestration",
    "classification": "Networking",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Kubernetes Services provide a stable endpoint for accessing a set of Pods. They define how to access the Pods via a network, enabling load balancing and service discovery.",
    "properties": {},
    "tags": []
  },
  "Kubernetes Pod": {
    "name": "Kubernetes Pod",
    "type": "Container Orchestration",
    "classification": "Workloads",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Kubernetes Pods are the smallest deployable units in Kubernetes that can be created, scheduled, and managed. A Pod represents a single instance of a running process in your cluster and can contain one or more containers.",
    "properties": {},
    "tags": []
  },
  "Kubernetes Job": {
    "name": "Kubernetes Job",
    "type": "Job",
    "classification": "Workload",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A Kubernetes Job creates one or more pods and ensures that a specified number of them successfully terminate. It is used to run batch processing or single-run tasks in a Kubernetes cluster.",
    "properties": {},
    "tags": ["Kubernetes", "Job", "Workload", "Batch Processing"]
  },
  "Kubernetes ConfigMap": {
    "name": "Kubernetes ConfigMap",
    "type": "Object Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A Kubernetes ConfigMap is an object that stores key-value pairs of configuration data that can be used by your applications. It allows you to decouple configuration settings from container images, making it easier to manage environment-specific configurations without modifying your app's code. ConfigMaps can be consumed as environment variables, command-line arguments, or mounted as configuration files inside containers.",
    "properties": {},
    "tags": ["Kubernetes", "Configuration"]
  },
  "Kubernetes Secret": {
    "name": "Kubernetes Secret",
    "type": "Secret",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "Kubernetes Secrets are objects used to store sensitive information, such as passwords, OAuth tokens, and SSH keys, in a Kubernetes cluster. They provide a way to secure and manage sensitive data.",
    "properties": {},
    "tags": ["Kubernetes", "Secret"]
  },
  "Docker Enterprise": {
    "name": "Docker Enterprise",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A container platform that allows developers to build, share, and run applications with ease, while providing IT teams with control and visibility over the entire container environment.",
    "properties": {},
    "tags": []
  },
  "Red Hat OpenShift": {
    "name": "Red Hat OpenShift",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A hybrid cloud platform that combines Kubernetes with enterprise-grade features for secure and scalable container orchestration.",
    "properties": {},
    "tags": []
  },
  "Rancher": {
    "name": "Rancher",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "An open-source platform that helps manage and deploy containers in production, while providing features like centralized authentication and monitoring.",
    "properties": {},
    "tags": []
  },
  "HashiCorp Nomad": {
    "name": "HashiCorp Nomad",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A container orchestration platform that simplifies the deployment and management of containerized applications across multiple clusters and environments.",
    "properties": {},
    "tags": []
  },
  "Mesosphere DC/OS": {
    "name": "Mesosphere DC/OS",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A distributed operating system that enables enterprises to easily deploy and manage modern applications, including containers, on any infrastructure.",
    "properties": {},
    "tags": []
  },
  "VMware Tanzu": {
    "name": "VMware Tanzu",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A suite of products that helps organizations build, run, and manage modern applications with containers, Kubernetes, and cloud-native technologies.",
    "properties": {},
    "tags": []
  },
  "Sysdig": {
    "name": "Sysdig",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A container security platform that provides visibility and monitoring of containerized applications, as well as real-time threat detection and response.",
    "properties": {},
    "tags": []
  },
  "Twistlock": {
    "name": "Twistlock",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A container security platform that integrates with popular container technologies to provide vulnerability management, compliance, and runtime protection.",
    "properties": {},
    "tags": []
  },
  "Portworx": {
    "name": "Portworx",
    "type": "Containers",
    "classification": "Compute Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/compute_services.svg",
    "description": "A cloud-native storage platform that enables enterprises to run stateful applications in containers, with features like data protection, encryption, and multi-cloud support.",
    "properties": {},
    "tags": []
  },
  "Calico": {
    "name": "Calico",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Calico is an open-source networking and network security solution designed for containerized environments. It provides scalable and secure network connectivity between containers and virtual machines, and supports various deployment models such as Kubernetes, Mesos, and Docker.",
    "properties": {},
    "tags": []
  },
  "Weave Net": {
    "name": "Weave Net",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Weave Net is a container networking solution that enables communication between containers across multiple hosts. It is designed to be lightweight and easy to use, and supports features such as service discovery, load balancing, and network isolation.",
    "properties": {},
    "tags": []
  },
  "Flannel": {
    "name": "Flannel",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Flannel is an open-source networking solution that provides a simple and reliable way to connect containers across multiple hosts. It uses a virtual network overlay to create a flat network space for containers to communicate, and can be integrated with popular container orchestration tools like Kubernetes and Mesos.",
    "properties": {},
    "tags": []
  },
  "Cilium": {
    "name": "Cilium",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Cilium is a container networking and security solution that leverages Linux kernel features to provide fast and secure communication between containers. It uses eBPF (extended Berkeley Packet Filter) technology to enforce network policies and provide deep visibility into network traffic.",
    "properties": {},
    "tags": []
  },
  "Contiv": {
    "name": "Contiv",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Contiv is an open-source container networking solution that provides multi-tenant networking capabilities for Docker, Kubernetes, and Mesos environments. It enables users to define network policies and manage network resources in a centralized manner, making it ideal for large-scale container deployments.",
    "properties": {},
    "tags": []
  },
  "Nuage Networks VSP": {
    "name": "Nuage Networks VSP",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Nuage Networks VSP is a software-defined networking solution designed specifically for containerized environments. It provides advanced network automation and virtualization capabilities, and is fully integrated with popular container orchestration tools.",
    "properties": {},
    "tags": []
  },
  "Aviatrix": {
    "name": "Aviatrix",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Aviatrix is a cloud networking solution that enables secure and reliable connectivity between containers and other cloud resources. It supports various cloud platforms, including AWS, Azure, and GCP, and provides features such as multi-cloud networking, traffic encryption, and load balancing.",
    "properties": {},
    "tags": []
  },
  "Project Calico for VMware NSX": {
    "name": "Project Calico for VMware NSX",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "Project Calico for VMware NSX is a solution that combines the networking capabilities of Calico with the security and micro-segmentation capabilities of VMware NSX. It allows users to easily deploy and manage secure container networks within VMware environments.",
    "properties": {},
    "tags": []
  },
  "F5 BIG-IP Virtual Edition": {
    "name": "F5 BIG-IP Virtual Edition",
    "type": "Container Networking",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "F5 BIG-IP Virtual Edition is a software-based application delivery controller that provides advanced networking and security features for container environments. It supports features such as load balancing, traffic management, and application security, and can be integrated with popular container orchestration tools.",
    "properties": {},
    "tags": []
  },
  "Docker Hub": {
    "name": "Docker Hub",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a cloud-based registry service for storing and sharing Docker container images, with features like automated builds and image versioning.",
    "properties": {},
    "tags": []
  },
  "Quay": {
    "name": "Quay",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a container registry that supports multiple formats (Docker, AppC, and OCI) and provides features like image scanning and vulnerability detection.",
    "properties": {},
    "tags": []
  },
  "JFrog Container Registry": {
    "name": "JFrog Container Registry",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a secure, highly available registry for storing and managing Docker images, with features like access control, replication, and clustering.",
    "properties": {},
    "tags": []
  },
  "Artifactory": {
    "name": "Artifactory",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a universal artifact repository and container registry that supports Docker images, as well as other package formats like Maven, npm, and NuGet.",
    "properties": {},
    "tags": []
  },
  "GitLab Container Registry": {
    "name": "GitLab Container Registry",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a registry for storing and managing Docker images, integrated with GitLab's continuous integration and deployment tools.",
    "properties": {},
    "tags": []
  },
  "Harbor": {
    "name": "Harbor",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "an open source container registry for managing Docker images, with features like access control, vulnerability scanning, and replication.",
    "properties": {},
    "tags": []
  },
  "Red Hat Quay": {
    "name": "Red Hat Quay",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a private container registry for managing and distributing Docker images, with features like security scanning, automated builds, and image promotion.",
    "properties": {},
    "tags": []
  },
  "Azure Container Registry": {
    "name": "Azure Container Registry",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a cloud-based registry service for storing and deploying Docker images in Microsoft Azure, with features like geo-replication and access control.",
    "properties": {},
    "tags": []
  },
  "Google Container Registry": {
    "name": "Google Container Registry",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a private container registry for storing and managing Docker images in Google Cloud Platform, with features like access control and vulnerability scanning.",
    "properties": {},
    "tags": []
  },
  "IBM Cloud Container Registry": {
    "name": "IBM Cloud Container Registry",
    "type": "Container Registries",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "a registry service for storing and managing Docker images in IBM Cloud, with features like image scanning, access control, and automated builds.",
    "properties": {},
    "tags": []
  },
  "Microsoft Azure Data Factory": {
    "name": "Microsoft Azure Data Factory",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A fully managed data integration service that allows users to build, schedule, and orchestrate data pipelines across cloud and on-premises data sources.",
    "properties": {},
    "tags": []
  },
  "IBM Cloud Pak for Integration": {
    "name": "IBM Cloud Pak for Integration",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "An enterprise-grade orchestration engine that enables users to connect and manage applications, data, and APIs across hybrid and multi-cloud environments.",
    "properties": {},
    "tags": []
  },
  "Informatica Intelligent Cloud Services": {
    "name": "Informatica Intelligent Cloud Services",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A cloud-native data integration platform that includes a comprehensive orchestration engine for automating data movement, transformation, and governance processes.",
    "properties": {},
    "tags": []
  },
  "TIBCO Cloud Integration": {
    "name": "TIBCO Cloud Integration",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "A cloud-based integration platform that includes an orchestration engine for connecting and automating data and processes across on-premises and cloud applications.",
    "properties": {},
    "tags": []
  },
  "Red Hat Integration": {
    "name": "Red Hat Integration",
    "type": "Orchestration Engines",
    "classification": "Containers and Orchestration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/containers.svg",
    "description": "An enterprise integration platform that includes a powerful orchestration engine for connecting and managing data and processes across hybrid and multi-cloud environments.",
    "properties": {},
    "tags": []
  },
  "InfluxDB": {
    "name": "InfluxDB",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A high-performance, open-source time-series database that is optimized for handling large amounts of time-stamped data. It is designed to be scalable, fault-tolerant, and easy to use.",
    "properties": {},
    "tags": []
  },
  "TimescaleDB": {
    "name": "TimescaleDB",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "An open-source relational database that is designed to handle time-series data at scale. It leverages PostgreSQL's capabilities and adds time-series specific features such as automatic data partitioning and compression.",
    "properties": {},
    "tags": []
  },
  "Prometheus": {
    "name": "Prometheus",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A popular open-source monitoring and alerting tool that also includes a time-series database for storing and querying metrics data. It is designed for monitoring highly dynamic and distributed systems.",
    "properties": {},
    "tags": []
  },
  "Graphite": {
    "name": "Graphite",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A widely-used open-source time-series database that specializes in storing and graphing metrics data. It is designed for high performance and can be easily integrated with various monitoring tools.",
    "properties": {},
    "tags": []
  },
  "CrateDB": {
    "name": "CrateDB",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A distributed SQL database that is designed to handle large volumes of time-series data in real-time. It is optimized for IoT and industrial use cases and can be deployed on-premises or in the cloud.",
    "properties": {},
    "tags": []
  },
  "Druid": {
    "name": "Druid",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "An open-source distributed database that is optimized for handling real-time analytics on large volumes of time-series data. It is designed for high performance and low-latency queries.",
    "properties": {},
    "tags": []
  },
  "MongoDB Atlas": {
    "name": "MongoDB Atlas",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A fully managed cloud database service that includes a time-series data type and specialized functions for storing and querying time-series data. It is highly scalable and available on AWS and other cloud platforms.",
    "properties": {},
    "tags": []
  },
  "KairosDB": {
    "name": "KairosDB",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "An open-source distributed database that is designed to store and query large volumes of time-series data in a scalable and efficient manner. It is highly customizable and can be integrated with various data sources.",
    "properties": {},
    "tags": []
  },
  "CrateDB Cloud": {
    "name": "CrateDB Cloud",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A fully managed cloud database service that is built on top of CrateDB and is optimized for handling time-series data. It includes features such as automatic scaling and data replication for high availability.",
    "properties": {},
    "tags": []
  },
  "TempoDB": {
    "name": "TempoDB",
    "type": "Time-Series Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A cloud-hosted time-series database that is designed for storing and analyzing large volumes of time-stamped data. It includes features such as automatic data partitioning and retention policies for efficient data management.",
    "properties": {},
    "tags": []
  },
  "Dynatrace": {
    "name": "Dynatrace",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This AI-powered monitoring platform provides real-time visibility into the health and performance of your AWS infrastructure, applications, and services.",
    "properties": {},
    "tags": []
  },
  "New Relic": {
    "name": "New Relic",
    "type": "Application Performance Monitoring",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "New Relic is a cloud-based application performance monitoring platform that offers real-time performance monitoring, error tracking, and root cause analysis for your applications. It provides deep visibility into your application's performance, user experience, and infrastructure performance.",
    "properties": {},
    "tags": []
  },
  "AppDynamics": {
    "name": "AppDynamics",
    "type": "Infrastructure Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "AppDynamics is an application performance monitoring tool that offers real-time visibility into the performance of your AWS resources. It provides detailed metrics and analytics for EC2 instances, databases, and other AWS services to help you troubleshoot and optimize your applications.",
    "properties": {},
    "tags": []
  },
  "PagerDuty": {
    "name": "PagerDuty",
    "type": "Application Performance Monitoring",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "PagerDuty is an incident management platform that integrates with your AWS environment to provide real-time alerts and notifications for any issues that may arise in your applications. It offers customizable workflows and automated escalations to help you respond and resolve incidents quickly.",
    "properties": {},
    "tags": []
  },
  "SolarWinds Server & Application Monitor": {
    "name": "SolarWinds Server & Application Monitor",
    "type": "Infrastructure Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "SolarWinds Server & Application Monitor is a comprehensive monitoring tool that offers visibility into the performance of your entire IT infrastructure, including AWS resources. It provides real-time monitoring, alerting, and reporting for EC2 instances, databases, and other AWS services.",
    "properties": {},
    "tags": []
  },
  "Stackify Retrace": {
    "name": "Stackify Retrace",
    "type": "Application Performance Monitoring",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "Stackify Retrace is an APM solution that provides end-to-end application monitoring for your AWS environment. It offers code-level insights, error tracking, and real-time performance metrics to help you optimize your applications for peak performance.",
    "properties": {},
    "tags": []
  },
  "LogicMonitor": {
    "name": "LogicMonitor",
    "type": "Infrastructure Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "LogicMonitor is a cloud-based infrastructure monitoring platform that offers visibility into the health and performance of your AWS resources. It provides real-time monitoring, alerting, and reporting for EC2 instances, databases, and other AWS services to help you maintain optimal performance.",
    "properties": {},
    "tags": []
  },
  "Instana": {
    "name": "Instana",
    "type": "Application Performance Monitoring",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "Instana is an AI-powered APM solution that automatically discovers and monitors all aspects of your application stack, including containers, microservices, and serverless functions. It offers real-time performance metrics and automated root cause analysis to help you troub",
    "properties": {},
    "tags": []
  },
  "Message Queue": {
    "name": "Message Queue",
    "type": "Message Queues",
    "classification": "Application Integration",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/application_integration.svg",
    "description": "A message queue is a form of asynchronous service-to-service communication used in serverless and microservices architectures. Messages are stored on the queue until they are processed by the consumer. This decouples services and allows them to scale independently.",
    "properties": {},
    "tags": []
  },
  "Jenkins": {
    "name": "Jenkins",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "Jenkins is an open-source automation server that allows developers to continuously build, test, and deploy their software. It supports integration with various tools and technologies, making it a popular choice for DevOps teams.",
    "properties": {},
    "tags": []
  },
  "CircleCI": {
    "name": "CircleCI",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "CircleCI is a cloud-based continuous integration and delivery platform that enables teams to automate their build, test, and deployment processes. It integrates with popular version control systems and cloud platforms, making it easy to set up and use.",
    "properties": {},
    "tags": []
  },
  "Travis CI": {
    "name": "Travis CI",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "Travis CI is a hosted continuous integration service that supports a variety of programming languages and integrates with popular version control systems. It offers a simple and intuitive interface for configuring and running automated tests and deployments.",
    "properties": {},
    "tags": []
  },
  "TeamCity": {
    "name": "TeamCity",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "TeamCity is a powerful continuous integration and deployment server from JetBrains. It allows teams to automate their build, test, and deployment processes for a wide range of languages and platforms, including .NET, Java, and mobile applications.",
    "properties": {},
    "tags": []
  },
  "Bamboo": {
    "name": "Bamboo",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "Bamboo is a continuous integration and deployment tool from Atlassian. It offers features such as automated build and test, deployment pipelines, and integration with popular tools like JIRA and Bitbucket.",
    "properties": {},
    "tags": []
  },
  "Octopus Deploy": {
    "name": "Octopus Deploy",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that automates the deployment and management of .NET applications, databases and services to any environment.",
    "properties": {},
    "tags": []
  },
  "CodeDeploy": {
    "name": "CodeDeploy",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "CodeDeploy is a deployment automation service from AWS that enables developers to deploy code to EC2 instances, on-premises servers, and Lambda functions. It integrates with various AWS services and supports common deployment patterns.",
    "properties": {},
    "tags": []
  },
  "DeployBot": {
    "name": "DeployBot",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "DeployBot is a deployment tool that automates the process of deploying code to different environments. It integrates with popular version control systems and hosting providers, making it easy to set up and use.",
    "properties": {},
    "tags": []
  },
  "Shippable": {
    "name": "Shippable",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "Shippable is a continuous integration and delivery platform that supports a variety of programming languages and integrates with popular tools like GitHub and Docker. It offers a simple and intuitive interface for automating build, test, and deployment processes.",
    "properties": {},
    "tags": []
  },
  "GitLab CI/CD": {
    "name": "GitLab CI/CD",
    "type": "Build and Deployment Tools",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "GitLab CI/CD is a continuous integration and delivery tool from GitLab that allows teams to automate their software development processes. It offers features such as automated testing, deployment pipelines, and integration with popular tools like Docker and Kubernetes.",
    "properties": {},
    "tags": []
  },
  "Terraform by HashiCorp": {
    "name": "Terraform by HashiCorp",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A popular open-source tool for building and managing infrastructure across multiple providers, including AWS, using declarative code.",
    "properties": {},
    "tags": []
  },
  "CloudFormation by Puppet": {
    "name": "CloudFormation by Puppet",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A powerful Infrastructure as Code tool that allows users to define and manage AWS resources using Puppet's configuration language.",
    "properties": {},
    "tags": []
  },
  "Ansible by Red Hat": {
    "name": "Ansible by Red Hat",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A simple and powerful automation tool that can be used for infrastructure provisioning, configuration management, and application deployment on AWS.",
    "properties": {},
    "tags": []
  },
  "Chef Automate by Chef": {
    "name": "Chef Automate by Chef",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A comprehensive DevOps platform that includes infrastructure automation, compliance and security, and continuous delivery for AWS environments.",
    "properties": {},
    "tags": []
  },
  "SaltStack Enterprise by SaltStack": {
    "name": "SaltStack Enterprise by SaltStack",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A scalable and secure Infrastructure as Code platform that enables users to manage and automate their AWS infrastructure using SaltStack's configuration management and orchestration capabilities.",
    "properties": {},
    "tags": []
  },
  "Pulumi by Pulumi": {
    "name": "Pulumi by Pulumi",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A modern Infrastructure as Code platform that allows users to write, deploy, and manage code for AWS infrastructure using popular programming languages like JavaScript, Python, and Go.",
    "properties": {},
    "tags": []
  },
  "CloudBolt by CloudBolt Software": {
    "name": "CloudBolt by CloudBolt Software",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A hybrid cloud management platform that helps organizations deploy and manage applications and infrastructure across AWS and other cloud providers.",
    "properties": {},
    "tags": []
  },
  "Octopus Deploy by Octopus Deploy": {
    "name": "Octopus Deploy by Octopus Deploy",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A deployment automation tool that supports AWS and other cloud providers, allowing teams to easily deploy and manage applications across different environments.",
    "properties": {},
    "tags": []
  },
  "SaltStack Cloud by SaltStack": {
    "name": "SaltStack Cloud by SaltStack",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A cloud orchestration and automation tool that enables users to manage and scale AWS infrastructure using SaltStack's powerful configuration management and event-driven automation capabilities.",
    "properties": {},
    "tags": []
  },
  "RightScale by Flexera": {
    "name": "RightScale by Flexera",
    "type": "Infrastructure as Code",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A cloud management platform that helps organizations optimize their AWS infrastructure by providing visibility, automation, and governance for their cloud resources.",
    "properties": {},
    "tags": []
  },
  "Visual Studio Code": {
    "name": "Visual Studio Code",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A highly customizable code editor with built-in debugging and Git integration, available on Windows, macOS, and Linux.",
    "properties": {},
    "tags": []
  },
  "IntelliJ IDEA": {
    "name": "IntelliJ IDEA",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A popular Java IDE with intelligent coding assistance and advanced debugging tools.",
    "properties": {},
    "tags": []
  },
  "Eclipse": {
    "name": "Eclipse",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A Java-based IDE that supports multiple languages and platforms, with a large ecosystem of plugins and extensions.",
    "properties": {},
    "tags": []
  },
  "NetBeans": {
    "name": "NetBeans",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A free and open source IDE for Java, JavaScript, HTML5, PHP, and C/C++, with features such as code completion, refactoring, and debugging.",
    "properties": {},
    "tags": []
  },
  "PyCharm": {
    "name": "PyCharm",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "An IDE specifically designed for Python development, with support for web development frameworks like Django and Flask.",
    "properties": {},
    "tags": []
  },
  "Sublime Text": {
    "name": "Sublime Text",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A lightweight and fast code editor with powerful features like multiple cursors and split editing, available on Windows, macOS, and Linux.",
    "properties": {},
    "tags": []
  },
  "Atom": {
    "name": "Atom",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A hackable text editor built by GitHub, with a modern and intuitive interface and a large community of extensions.",
    "properties": {},
    "tags": []
  },
  "Code::Blocks": {
    "name": "Code::Blocks",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A cross-platform IDE for C, C++, and Fortran development, with features like code completion and project templates.",
    "properties": {},
    "tags": []
  },
  "BlueJ": {
    "name": "BlueJ",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "An educational IDE for Java development, with visual tools to help beginner programmers learn object-oriented programming.",
    "properties": {},
    "tags": []
  },
  "Komodo IDE": {
    "name": "Komodo IDE",
    "type": "Integrated Development Environments",
    "classification": "Developer Tools",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/developer_tools.svg",
    "description": "A full-featured IDE for web and mobile development, with support for multiple languages and frameworks.",
    "properties": {},
    "tags": []
  },
  "Microsoft Azure IoT Hub": {
    "name": "Microsoft Azure IoT Hub",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This cloud-based service enables secure and reliable communication between IoT devices and applications. It also offers features such as device-to-cloud and cloud-to-device messaging, device management, and bi-directional communication.",
    "properties": {},
    "tags": []
  },
  "IBM Watson IoT Platform": {
    "name": "IBM Watson IoT Platform",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This platform provides tools for connecting, managing, and analyzing data from IoT devices. It includes features such as device management, real-time data analysis, and cognitive capabilities for predictive maintenance.",
    "properties": {},
    "tags": []
  },
  "Cisco IoT Control Center": {
    "name": "Cisco IoT Control Center",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This solution offers a secure and scalable way to manage and monitor IoT devices. It includes features such as device provisioning, configuration, and diagnostics, as well as real-time data analytics and security monitoring.",
    "properties": {},
    "tags": []
  },
  "Siemens MindSphere": {
    "name": "Siemens MindSphere",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This cloud-based platform provides tools for collecting, analyzing, and visualizing data from connected devices. It also offers features such as device management, predictive maintenance, and remote monitoring and control.",
    "properties": {},
    "tags": []
  },
  "Bosch IoT Suite": {
    "name": "Bosch IoT Suite",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This comprehensive platform offers services for managing, analyzing, and connecting IoT devices. It includes features such as device management, data analytics, and integration with other business systems.",
    "properties": {},
    "tags": []
  },
  "Arm Pelion": {
    "name": "Arm Pelion",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This platform provides a secure and scalable way to connect and manage IoT devices. It includes features such as device provisioning, remote monitoring and control, and data analytics.",
    "properties": {},
    "tags": []
  },
  "Telit IoT Platform": {
    "name": "Telit IoT Platform",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This cloud-based platform offers services for managing and monitoring IoT devices. It includes features such as device management, data analytics, and integration with third-party applications.",
    "properties": {},
    "tags": []
  },
  "Ayla Networks IoT Platform": {
    "name": "Ayla Networks IoT Platform",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This platform offers a flexible and scalable way to connect and manage IoT devices. It includes features such as device management, data analytics, and integration with enterprise systems.",
    "properties": {},
    "tags": []
  },
  "ThingWorx IoT Platform": {
    "name": "ThingWorx IoT Platform",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This platform provides tools for building and managing IoT applications. It includes features such as device management, real-time data analytics, and integration with other business systems.",
    "properties": {},
    "tags": []
  },
  "Cumulocity IoT Platform": {
    "name": "Cumulocity IoT Platform",
    "type": "IoT Device Management",
    "classification": "IoT",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/iot.svg",
    "description": "This cloud-based platform offers services for connecting, managing, and analyzing data from IoT devices. It includes features such as device management, real-time data analytics, and integration with enterprise systems.",
    "properties": {},
    "tags": []
  },
  "Labelbox": {
    "name": "Labelbox",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A data labeling platform that combines human and machine intelligence to create high quality training data for AI models.",
    "properties": {},
    "tags": []
  },
  "Dataloop": {
    "name": "Dataloop",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "An end-to-end data labeling platform for computer vision and natural language processing tasks, with features such as automated annotation and quality control.",
    "properties": {},
    "tags": []
  },
  "SuperAnnotate": {
    "name": "SuperAnnotate",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A collaborative data annotation platform that supports image, video, and text data for AI training.",
    "properties": {},
    "tags": []
  },
  "Label Studio": {
    "name": "Label Studio",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A data labeling tool that uses active learning and human-in-the-loop methods to improve annotation accuracy and speed.",
    "properties": {},
    "tags": []
  },
  "CloudFactory": {
    "name": "CloudFactory",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A managed workforce platform for data labeling, with a global team of skilled workers and tools for quality control and data management.",
    "properties": {},
    "tags": []
  },
  "Playment": {
    "name": "Playment",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A data labeling platform that uses a combination of human and machine learning to provide high-quality training data for computer vision and natural language processing models.",
    "properties": {},
    "tags": []
  },
  "Hive": {
    "name": "Hive",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A data annotation and labeling tool that uses AI and machine learning to automate and accelerate the labeling process, while also providing tools for quality control and collaboration.",
    "properties": {},
    "tags": []
  },
  "Scale AI": {
    "name": "Scale AI",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A data labeling and annotation service that combines human and machine intelligence to provide high-quality training data for computer vision and natural language processing tasks.",
    "properties": {},
    "tags": []
  },
  "Appen": {
    "name": "Appen",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A global leader in data annotation and labeling services, with a large crowd of skilled workers and tools for quality control and project management.",
    "properties": {},
    "tags": []
  },
  "CloudFactory AI Data Solutions": {
    "name": "CloudFactory AI Data Solutions",
    "type": "Data Labeling",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "A comprehensive data labeling and annotation platform that offers a variety of services such as data collection, labeling, transcription, and moderation.",
    "properties": {},
    "tags": []
  },
  "Deep Reinforcement Learning in Finance": {
    "name": "Deep Reinforcement Learning in Finance",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product utilizes deep reinforcement learning algorithms to provide financial institutions with predictive analytics and decision-making tools. It can be used for portfolio optimization, risk management, and trading strategies.",
    "properties": {},
    "tags": []
  },
  "Gym for OpenAI": {
    "name": "Gym for OpenAI",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product offers a simulation environment for reinforcement learning agents, allowing users to train and test their algorithms in a variety of scenarios. It is built on top of the popular OpenAI Gym platform.",
    "properties": {},
    "tags": []
  },
  "Reinforcement Learning for Autonomous Driving": {
    "name": "Reinforcement Learning for Autonomous Driving",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product provides a comprehensive suite of tools and algorithms for training autonomous driving systems using reinforcement learning. It includes simulation environments, pre-trained models, and data analysis tools.",
    "properties": {},
    "tags": []
  },
  "Robotics Simulation and Reinforcement Learning": {
    "name": "Robotics Simulation and Reinforcement Learning",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product offers a simulation platform for training and testing reinforcement learning algorithms for robotics applications. It includes a library of pre-defined robot models and environments, as well as tools for data analysis and visualization.",
    "properties": {},
    "tags": []
  },
  "Chatbot Development with Reinforcement Learning": {
    "name": "Chatbot Development with Reinforcement Learning",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product allows users to build chatbots using reinforcement learning techniques. It includes pre-trained models for common use cases, as well as a development platform for custom chatbot development.",
    "properties": {},
    "tags": []
  },
  "Reinforcement Learning for Supply Chain Optimization": {
    "name": "Reinforcement Learning for Supply Chain Optimization",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product offers a suite of tools and algorithms for optimizing supply chain operations using reinforcement learning. It can be used for inventory management, demand forecasting, and route optimization.",
    "properties": {},
    "tags": []
  },
  "Reinforcement Learning for Game AI": {
    "name": "Reinforcement Learning for Game AI",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product provides a platform for game developers to implement reinforcement learning algorithms for game AI. It includes tools for game simulation, data collection, and model training.",
    "properties": {},
    "tags": []
  },
  "Robotic Process Automation with Reinforcement Learning": {
    "name": "Robotic Process Automation with Reinforcement Learning",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product allows users to automate business processes using reinforcement learning algorithms. It includes pre-trained models for common tasks, as well as a development platform for custom automation workflows.",
    "properties": {},
    "tags": []
  },
  "Industrial Control Systems with Reinforcement Learning": {
    "name": "Industrial Control Systems with Reinforcement Learning",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product offers a suite of tools and algorithms for optimizing industrial control systems using reinforcement learning. It can be used for process control, predictive maintenance, and anomaly detection.",
    "properties": {},
    "tags": []
  },
  "Reinforcement Learning for Energy Management": {
    "name": "Reinforcement Learning for Energy Management",
    "type": "Reinforcement Learning",
    "classification": "Machine Learning and AI Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/ai_services.svg",
    "description": "This product provides a platform for optimizing energy consumption using reinforcement learning algorithms. It can be used for building energy management, smart grid optimization, and demand response.",
    "properties": {},
    "tags": []
  },
  "Chef Automate": {
    "name": "Chef Automate",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that automates the deployment and management of infrastructure and applications in the cloud and on-premises.",
    "properties": {},
    "tags": []
  },
  "Puppet Enterprise": {
    "name": "Puppet Enterprise",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that enables organizations to automate the provisioning, configuration and management of their infrastructure and applications.",
    "properties": {},
    "tags": []
  },
  "Ansible Automation Platform": {
    "name": "Ansible Automation Platform",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that automates the deployment and management of IT infrastructure and applications, with a focus on simplicity and ease of use.",
    "properties": {},
    "tags": []
  },
  "SaltStack Enterprise": {
    "name": "SaltStack Enterprise",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that automates the deployment, configuration and management of infrastructure and applications at scale.",
    "properties": {},
    "tags": []
  },
  "Terraform Enterprise": {
    "name": "Terraform Enterprise",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that enables organizations to define and provision infrastructure and applications using Infrastructure as Code (IaC) principles.",
    "properties": {},
    "tags": []
  },
  "CFEngine": {
    "name": "CFEngine",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that automates the provisioning, configuration and management of large-scale IT infrastructures, with a focus on security and compliance.",
    "properties": {},
    "tags": []
  },
  "Microsoft System Center Configuration Manager": {
    "name": "Microsoft System Center Configuration Manager",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that enables organizations to manage and deploy applications, updates, and settings across a variety of devices and operating systems.",
    "properties": {},
    "tags": []
  },
  "BMC BladeLogic Server Automation": {
    "name": "BMC BladeLogic Server Automation",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that automates the management of servers, databases, and middleware in both physical and virtual environments.",
    "properties": {},
    "tags": []
  },
  "IBM UrbanCode Deploy": {
    "name": "IBM UrbanCode Deploy",
    "type": "Configuration Management",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "a configuration management tool that automates the deployment and management of applications, databases, and infrastructure across hybrid environments.",
    "properties": {},
    "tags": []
  },
  "New Relic Infrastructure": {
    "name": "New Relic Infrastructure",
    "type": "Infrastructure Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "New Relic Infrastructure is a monitoring tool that provides visibility into the health and performance of your infrastructure, including AWS resources. It offers real-time monitoring, alerting, and troubleshooting for EC2 instances, databases, and other AWS services.",
    "properties": {},
    "tags": []
  },
  "Splunk Enterprise": {
    "name": "Splunk Enterprise",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "With this product, you can gain insights and analyze machine data from your AWS environments, helping you to troubleshoot issues and optimize performance.",
    "properties": {},
    "tags": []
  },
  "ManageEngine Applications Manager": {
    "name": "ManageEngine Applications Manager",
    "type": "Infrastructure Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "ManageEngine Applications Manager is an all-in-one monitoring tool that offers real-time monitoring, troubleshooting, and alerting for your AWS resources. It provides detailed performance metrics for EC2 instances, databases, and other AWS services to help you optimize your applications.",
    "properties": {},
    "tags": []
  },
  "Site24x7": {
    "name": "Site24x7",
    "type": "Infrastructure Monitoring",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "Site24x7 is a cloud-based monitoring solution that offers visibility into the performance of your entire IT infrastructure, including AWS resources. It provides real-time monitoring, alerting, and reporting for EC2 instances",
    "properties": {},
    "tags": []
  },
  "McAfee Cloud Workload Security": {
    "name": "McAfee Cloud Workload Security",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This product offers comprehensive security for Amazon EC2 instances, protecting against advanced threats and vulnerabilities.",
    "properties": {},
    "tags": []
  },
  "Trend Micro Deep Security": {
    "name": "Trend Micro Deep Security",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This product offers advanced security capabilities for AWS workloads, including intrusion detection and prevention, anti-malware, and web application protection.",
    "properties": {},
    "tags": []
  },
  "CloudCheckr": {
    "name": "CloudCheckr",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This cost optimization and governance tool helps you to manage your AWS resources and ensure compliance with best practices, leading to cost savings and improved security.",
    "properties": {},
    "tags": []
  },
  "CloudEndure Disaster Recovery": {
    "name": "CloudEndure Disaster Recovery",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This product provides automated disaster recovery for your AWS workloads, ensuring minimal downtime and data loss in the event of a disaster.",
    "properties": {},
    "tags": []
  },
  "CloudHealth": {
    "name": "CloudHealth",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This cloud management platform offers cost optimization, governance, and security features for your AWS environment, helping you to optimize your cloud spend and improve security posture.",
    "properties": {},
    "tags": []
  },
  "Commvault": {
    "name": "Commvault",
    "type": "Service Catalog",
    "classification": "Management and Monitoring",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/monitoring.svg",
    "description": "This data management platform offers backup, recovery, and archiving solutions for your AWS workloads, ensuring data protection and availability in the cloud.",
    "properties": {},
    "tags": []
  },
  "Akamai Content Delivery Network": {
    "name": "Akamai Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Akamai is a leading content delivery network provider, offering fast and reliable delivery of content, web applications, and APIs. Their CDN is designed to optimize performance, scalability, and security for websites and applications.",
    "properties": {},
    "tags": []
  },
  "CloudFlare Content Delivery Network": {
    "name": "CloudFlare Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "CloudFlare is a popular CDN that helps websites and applications load faster by caching content and distributing it across a global network of servers. It also offers security features such as DDoS protection and web application firewall.",
    "properties": {},
    "tags": []
  },
  "Fastly Content Delivery Network": {
    "name": "Fastly Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Fastly is a CDN that specializes in high-performance content delivery, with a focus on video and streaming content. They offer real-time analytics and advanced caching options to help improve website and application performance.",
    "properties": {},
    "tags": []
  },
  "Limelight Content Delivery Network": {
    "name": "Limelight Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Limelight is a global CDN provider that offers a suite of services for content delivery, video delivery, and website acceleration. Their network includes over 80 points of presence (PoPs) around the world for reliable and fast content delivery.",
    "properties": {},
    "tags": []
  },
  "Verizon Media EdgeCast Content Delivery Network": {
    "name": "Verizon Media EdgeCast Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Verizon Media EdgeCast is a CDN that offers high-performance content delivery, video streaming, and website acceleration. It also offers advanced features such as real-time analytics, SSL support, and DDoS protection.",
    "properties": {},
    "tags": []
  },
  "StackPath Content Delivery Network": {
    "name": "StackPath Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "StackPath is a CDN that offers fast and secure content delivery for websites and applications, with a focus on performance and scalability. It also includes advanced features such as real-time analytics, web application firewall, and bot management.",
    "properties": {},
    "tags": []
  },
  "CDNetworks Content Delivery Network": {
    "name": "CDNetworks Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "CDNetworks is a global CDN provider that offers fast and reliable content delivery, with a focus on improving website and application performance in Asia and other regions. It also offers advanced security features such as DDoS protection and web application firewall.",
    "properties": {},
    "tags": []
  },
  "Instart Content Delivery Network": {
    "name": "Instart Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "Instart is a CDN that uses machine learning and AI to optimize content delivery and improve website and application performance. It also offers advanced security features such as bot protection and real-time threat intelligence.",
    "properties": {},
    "tags": []
  },
  "CacheFly Content Delivery Network": {
    "name": "CacheFly Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "CacheFly is a CDN that focuses on high-performance content delivery for large files, such as software downloads and media files. It offers real-time analytics and advanced caching options to improve website and application performance.",
    "properties": {},
    "tags": []
  },
  "G-Core Labs Content Delivery Network": {
    "name": "G-Core Labs Content Delivery Network",
    "type": "Content Delivery Network",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "G-Core Labs is a global CDN provider that offers fast and reliable content delivery, with a focus on improving performance for websites and applications in emerging markets. It",
    "properties": {},
    "tags": []
  },
  "SolarWinds Network Performance Monitor": {
    "name": "SolarWinds Network Performance Monitor",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A comprehensive network monitoring tool that provides real-time visibility and analytics for network performance and health.",
    "properties": {},
    "tags": []
  },
  "ManageEngine OpManager": {
    "name": "ManageEngine OpManager",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A unified network performance monitoring and management solution that offers advanced analytics and reporting capabilities.",
    "properties": {},
    "tags": []
  },
  "PRTG Network Monitor": {
    "name": "PRTG Network Monitor",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A powerful network monitoring tool that offers real-time performance monitoring, alerts, and reporting for networks of any size.",
    "properties": {},
    "tags": []
  },
  "Cisco DNA Center": {
    "name": "Cisco DNA Center",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A central management platform for Cisco networks that provides network visibility, analytics, and automation capabilities.",
    "properties": {},
    "tags": []
  },
  "Riverbed SteelCentral NetProfiler": {
    "name": "Riverbed SteelCentral NetProfiler",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A network performance monitoring solution that offers end-to-end visibility and analytics for multi-vendor networks.",
    "properties": {},
    "tags": []
  },
  "AppNeta": {
    "name": "AppNeta",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A network monitoring and performance testing solution that provides real-time visibility and analytics for business-critical applications.",
    "properties": {},
    "tags": []
  },
  "ExtraHop": {
    "name": "ExtraHop",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A network analytics platform that uses machine learning to provide real-time visibility and insights into network behavior and performance.",
    "properties": {},
    "tags": []
  },
  "Riverbed SteelCentral AppResponse": {
    "name": "Riverbed SteelCentral AppResponse",
    "type": "Network Monitoring and Analytics",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A network and application performance monitoring tool that offers deep packet inspection and analytics for troubleshooting and optimization.",
    "properties": {},
    "tags": []
  },
  "OpenVPN Access Server": {
    "name": "OpenVPN Access Server",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A secure and scalable virtual private network solution that allows businesses to securely access their AWS resources from any location.",
    "properties": {},
    "tags": []
  },
  "Fortinet FortiGate NGFW": {
    "name": "Fortinet FortiGate NGFW",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A next-generation firewall that provides advanced threat protection and secure connectivity for virtual private clouds.",
    "properties": {},
    "tags": []
  },
  "Barracuda CloudGen Firewall": {
    "name": "Barracuda CloudGen Firewall",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A cloud-based firewall that offers advanced security features such as intrusion prevention, web filtering, and network segmentation for virtual private clouds.",
    "properties": {},
    "tags": []
  },
  "Palo Alto Networks VM-Series": {
    "name": "Palo Alto Networks VM-Series",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A virtualized next-generation firewall that allows organizations to secure their virtual private cloud environments with advanced threat prevention capabilities.",
    "properties": {},
    "tags": []
  },
  "Citrix NetScaler VPX": {
    "name": "Citrix NetScaler VPX",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A virtual application delivery controller that provides load balancing, traffic management, and secure remote access for applications running in virtual private clouds.",
    "properties": {},
    "tags": []
  },
  "Sophos XG Firewall": {
    "name": "Sophos XG Firewall",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "An all-in-one next-generation firewall that offers advanced security features, such as intrusion prevention, web filtering, and VPN connectivity, for virtual private clouds.",
    "properties": {},
    "tags": []
  },
  "Check Point CloudGuard": {
    "name": "Check Point CloudGuard",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A cloud-native security solution that provides threat prevention, network security, and visibility for virtual private clouds.",
    "properties": {},
    "tags": []
  },
  "McAfee Virtual Network Security Platform": {
    "name": "McAfee Virtual Network Security Platform",
    "type": "Virtual Private Cloud",
    "classification": "Networking Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/networking_services.svg",
    "description": "A virtualized network security solution that offers advanced threat protection, intrusion prevention, and application control for virtual private clouds.",
    "properties": {},
    "tags": []
  },
  "Okta Identity Cloud": {
    "name": "Okta Identity Cloud",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This is a cloud-based identity and access management solution that provides secure single sign-on, multi-factor authentication, and user lifecycle management for applications and devices.",
    "properties": {},
    "tags": []
  },
  "Duo Security": {
    "name": "Duo Security",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "Duo Security is a multi-factor authentication solution that helps organizations protect against data breaches and account takeover by verifying the identity of users and devices before granting access to applications or data.",
    "properties": {},
    "tags": []
  },
  "Ping Identity": {
    "name": "Ping Identity",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "Ping Identity is an identity and access management platform that enables organizations to securely manage and authenticate user access across multiple applications and endpoints.",
    "properties": {},
    "tags": []
  },
  "Auth0": {
    "name": "Auth0",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "Auth0 is a modern identity platform that provides authentication and authorization as a service, allowing developers to easily add user management and security features to their applications.",
    "properties": {},
    "tags": []
  },
  "OneLogin": {
    "name": "OneLogin",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "OneLogin is a cloud-based identity and access management solution that provides single sign-on, multi-factor authentication, and user provisioning for cloud applications, on-premises applications, and SaaS applications.",
    "properties": {},
    "tags": []
  },
  "Centrify Identity Platform": {
    "name": "Centrify Identity Platform",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "Centrify Identity Platform is a comprehensive identity and access management solution that provides single sign-on, multi-factor authentication, and privileged access management for cloud, mobile, and on-premises applications.",
    "properties": {},
    "tags": []
  },
  "ForgeRock Identity Platform": {
    "name": "ForgeRock Identity Platform",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "ForgeRock Identity Platform is an open-source identity and access management solution that provides a unified identity and access management platform for web, mobile, and IoT applications.",
    "properties": {},
    "tags": []
  },
  "CyberArk Privileged Access Security": {
    "name": "CyberArk Privileged Access Security",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "CyberArk Privileged Access Security is a solution for managing and securing privileged access to critical systems and data. It provides centralized control and monitoring of privileged access, reducing the risk of insider threats and external attacks.",
    "properties": {},
    "tags": []
  },
  "BeyondTrust Privilege Management for Windows": {
    "name": "BeyondTrust Privilege Management for Windows",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "BeyondTrust Privilege Management for Windows is a solution for managing and securing privileged access to Windows endpoints. It provides granular control over user privileges, reducing the risk of privilege abuse and malware attacks.",
    "properties": {},
    "tags": []
  },
  "SecureAuth Identity Platform": {
    "name": "SecureAuth Identity Platform",
    "type": "Authorization Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "SecureAuth Identity Platform is an adaptive authentication and single sign-on solution that uses risk-based authentication to provide secure access to applications, devices, and networks. It supports multi-factor authentication, single sign-on, and user self-service.",
    "properties": {},
    "tags": []
  },
  "Thales Data Protection on Demand": {
    "name": "Thales Data Protection on Demand",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This service offers a suite of encryption and key management solutions that can be easily deployed on AWS, providing organizations with secure data storage and transfer capabilities.",
    "properties": {},
    "tags": []
  },
  "Fortanix Self-Defending Key Management Service": {
    "name": "Fortanix Self-Defending Key Management Service",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This product offers a cloud-native key management platform that enables organizations to securely store, manage, and use encryption keys on AWS.",
    "properties": {},
    "tags": []
  },
  "Vormetric Transparent Encryption": {
    "name": "Vormetric Transparent Encryption",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This service provides data encryption and access controls for sensitive data stored on AWS, helping organizations meet compliance requirements and protect against data breaches.",
    "properties": {},
    "tags": []
  },
  "Gemalto SafeNet ProtectV": {
    "name": "Gemalto SafeNet ProtectV",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This product allows organizations to encrypt virtual machines and storage volumes on AWS, ensuring data confidentiality and integrity in the cloud.",
    "properties": {},
    "tags": []
  },
  "CipherCloud Cloud Encryption Gateway": {
    "name": "CipherCloud Cloud Encryption Gateway",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This service offers strong encryption and tokenization for data stored in AWS, ensuring data privacy and compliance with industry and regulatory standards.",
    "properties": {},
    "tags": []
  },
  "CloudHSM": {
    "name": "CloudHSM",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This service provides dedicated hardware security modules (HSM) for key management and encryption on AWS, allowing organizations to maintain control over their encryption keys and meet compliance requirements.",
    "properties": {},
    "tags": []
  },
  "Thycotic Secret Server": {
    "name": "Thycotic Secret Server",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This product offers a secure and centralized platform for managing privileged access and credentials on AWS, with encryption capabilities to ensure protection against cyber threats.",
    "properties": {},
    "tags": []
  },
  "Check Point CloudGuard IaaS": {
    "name": "Check Point CloudGuard IaaS",
    "type": "Encryption Services",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "This service provides advanced threat prevention and encryption for workloads on AWS, helping organizations secure their cloud environments and comply with industry regulations.",
    "properties": {},
    "tags": []
  },
  "Fortinet FortiGate Next-Generation Firewall": {
    "name": "Fortinet FortiGate Next-Generation Firewall",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "A high-performance firewall that offers integrated threat management and advanced security features for AWS deployments.",
    "properties": {},
    "tags": []
  },
  "Palo Alto Networks VM-Series Next-Generation Firewall": {
    "name": "Palo Alto Networks VM-Series Next-Generation Firewall",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "A virtualized firewall that provides advanced security features for protecting applications and data in the cloud.",
    "properties": {},
    "tags": []
  },
  "Check Point CloudGuard Network Security": {
    "name": "Check Point CloudGuard Network Security",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "A cloud-native firewall that integrates with AWS services to provide advanced threat prevention and network security.",
    "properties": {},
    "tags": []
  },
  "Cisco ASAv Virtual Firewall": {
    "name": "Cisco ASAv Virtual Firewall",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "A virtualized firewall that offers advanced security features and can be easily integrated with existing Cisco security solutions.",
    "properties": {},
    "tags": []
  },
  "SonicWall NSv Virtual Firewall": {
    "name": "SonicWall NSv Virtual Firewall",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "A virtualized firewall that offers advanced security features such as intrusion prevention, application control, and content filtering.",
    "properties": {},
    "tags": []
  },
  "McAfee Network Security Platform": {
    "name": "McAfee Network Security Platform",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "A network intrusion prevention system that provides real-time threat detection and prevention for AWS environments.",
    "properties": {},
    "tags": []
  },
  "Juniper Networks vSRX Virtual Firewall": {
    "name": "Juniper Networks vSRX Virtual Firewall",
    "type": "Firewall",
    "classification": "Security and Identity Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/security_services.svg",
    "description": "A virtualized firewall that offers advanced security features and integrates with other Juniper security solutions.",
    "properties": {},
    "tags": []
  },
  "IBM Cloud Block Storage": {
    "name": "IBM Cloud Block Storage",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "This product offers persistent storage for IBM Cloud virtual servers, with options for high-performance SSD or cost-effective HDD storage.",
    "properties": {},
    "tags": []
  },
  "NetApp Cloud Volumes ONTAP": {
    "name": "NetApp Cloud Volumes ONTAP",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A cloud-based enterprise storage solution that provides advanced data management capabilities such as data deduplication, compression, and encryption.",
    "properties": {},
    "tags": []
  },
  "Dell EMC PowerMax": {
    "name": "Dell EMC PowerMax",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A high-performance block storage solution designed for demanding workloads, with features such as automated tiering, data reduction, and data protection.",
    "properties": {},
    "tags": []
  },
  "Pure Storage FlashArray": {
    "name": "Pure Storage FlashArray",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A flash-based block storage solution designed for high-performance applications, featuring data reduction, data protection, and cloud integration capabilities.",
    "properties": {},
    "tags": []
  },
  "Hitachi Vantara VSP": {
    "name": "Hitachi Vantara VSP",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A block storage solution that offers high performance, scalability, and advanced data management capabilities such as thin provisioning and data deduplication.",
    "properties": {},
    "tags": []
  },
  "Red Hat Ceph Storage": {
    "name": "Red Hat Ceph Storage",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A distributed block storage system that is highly scalable and fault-tolerant, making it suitable for large-scale data storage and analytics workloads.",
    "properties": {},
    "tags": []
  },
  "Huawei OceanStor": {
    "name": "Huawei OceanStor",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A high-performance block storage solution with advanced features such as data compression, deduplication, and data tiering for optimized storage efficiency.",
    "properties": {},
    "tags": []
  },
  "Oracle Block Volumes": {
    "name": "Oracle Block Volumes",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A scalable and high-performance block storage solution for Oracle Cloud Infrastructure, featuring data encryption, replication, and automated backups.",
    "properties": {},
    "tags": []
  },
  "Cloudian HyperStore": {
    "name": "Cloudian HyperStore",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A software-defined object storage solution that can be deployed on-premises or in the cloud, with features such as data encryption, data versioning, and multi-tenancy.",
    "properties": {},
    "tags": []
  },
  "Kaminario K2": {
    "name": "Kaminario K2",
    "type": "Block Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A block storage solution designed for high-performance enterprise workloads, with features such as data deduplication, thin provisioning, and advanced data protection capabilities.",
    "properties": {},
    "tags": []
  },
  "SwiftStack": {
    "name": "SwiftStack",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Object storage solution for cold data archiving, with support for multiple tiers of storage and advanced data management features.",
    "properties": {},
    "tags": []
  },
  "Veritas NetBackup": {
    "name": "Veritas NetBackup",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Enterprise-grade backup and recovery solution for cold data, with support for multiple storage environments and data deduplication.",
    "properties": {},
    "tags": []
  },
  "Hitachi Content Platform": {
    "name": "Hitachi Content Platform",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Object storage platform for cold data archiving, with advanced data governance and compliance features.",
    "properties": {},
    "tags": []
  },
  "Cohesity DataPlatform": {
    "name": "Cohesity DataPlatform",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Unified data management platform for cold data, with support for multiple storage environments and global deduplication.",
    "properties": {},
    "tags": []
  },
  "Pure Storage FlashBlade": {
    "name": "Pure Storage FlashBlade",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "High-performance data storage solution for cold data, with support for high-speed data access and scalable capacity.",
    "properties": {},
    "tags": []
  },
  "IBM Spectrum Discover": {
    "name": "IBM Spectrum Discover",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "AI-powered data management platform for cold data, with advanced data classification and policy-based archiving.",
    "properties": {},
    "tags": []
  },
  "Rubrik Cloud Data Management": {
    "name": "Rubrik Cloud Data Management",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Cloud-based data management platform for cold data, with support for hybrid cloud environments and automated data lifecycle management.",
    "properties": {},
    "tags": []
  },
  "Spectra Logic BlackPearl": {
    "name": "Spectra Logic BlackPearl",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Tape-based data archiving solution for cold data, with support for scalable storage and automated data retention policies.",
    "properties": {},
    "tags": []
  },
  "Veeam Backup & Replication": {
    "name": "Veeam Backup & Replication",
    "type": "Cold/Archive Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "Comprehensive data protection and management platform for cold data, with support for multiple storage environments and disaster recovery capabilities.",
    "properties": {},
    "tags": []
  },
  "JetStream Edge": {
    "name": "JetStream Edge",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A high-performance edge storage solution that enables real-time data processing and analytics at the edge. It supports a variety of data sources and offers advanced data management capabilities.",
    "properties": {},
    "tags": []
  },
  "ClearBlade Edge Data Platform": {
    "name": "ClearBlade Edge Data Platform",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "An edge-native data storage and management platform that supports distributed data processing and analytics at the edge. It offers advanced security and data encryption features.",
    "properties": {},
    "tags": []
  },
  "MemSQL Edge": {
    "name": "MemSQL Edge",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A distributed edge database that enables real-time analytics and decision-making at the edge. It integrates with existing data sources and supports advanced data processing and machine learning capabilities.",
    "properties": {},
    "tags": []
  },
  "Cloudian HyperStore Edge": {
    "name": "Cloudian HyperStore Edge",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A software-defined storage platform that enables edge data storage and management. It supports data deduplication and compression, ensuring efficient use of storage resources.",
    "properties": {},
    "tags": []
  },
  "ScaleOut GeoServer": {
    "name": "ScaleOut GeoServer",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A distributed data storage solution that enables real-time data processing and analytics at the edge. It supports advanced data replication and disaster recovery capabilities.",
    "properties": {},
    "tags": []
  },
  "Redis Edge": {
    "name": "Redis Edge",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A high-performance, in-memory data storage and processing platform that enables real-time data analytics and decision-making at the edge. It supports advanced data structures and caching capabilities.",
    "properties": {},
    "tags": []
  },
  "Kinetica Edge": {
    "name": "Kinetica Edge",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "An edge-native database that supports real-time data processing and analytics at the edge. It offers advanced data visualization and machine learning capabilities.",
    "properties": {},
    "tags": []
  },
  "Qumulo Edge": {
    "name": "Qumulo Edge",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A scalable, distributed file storage solution that enables edge data storage and management. It supports advanced data protection and access control features.",
    "properties": {},
    "tags": []
  },
  "Dremio Edge": {
    "name": "Dremio Edge",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A data lake engine that enables real-time data processing and analytics at the edge. It supports a variety of data sources and offers advanced data integration capabilities.",
    "properties": {},
    "tags": []
  },
  "Hazelcast Jet": {
    "name": "Hazelcast Jet",
    "type": "Edge Storage",
    "classification": "Storage Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/storage_service.svg",
    "description": "A distributed, in-memory data processing platform that enables real-time analytics and decision-making at the edge. It supports advanced data streaming and event processing capabilities.",
    "properties": {},
    "tags": []
  },
  "Microsoft SQL Server": {
    "name": "Microsoft SQL Server",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A relational database management system developed by Microsoft that supports data storage, manipulation, and retrieval. It is widely used for enterprise applications and offers features such as data warehousing, business intelligence, and advanced analytics.",
    "properties": {},
    "tags": []
  },
  "Oracle Database": {
    "name": "Oracle Database",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A powerful and flexible relational database management system developed by Oracle Corporation. It offers a wide range of features including data warehousing, advanced analytics, and application development.",
    "properties": {},
    "tags": []
  },
  "IBM Db2": {
    "name": "IBM Db2",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A relational database management system developed by IBM that offers high performance, scalability, and reliability. It is designed for enterprise applications and supports a variety of data types and workloads.",
    "properties": {},
    "tags": []
  },
  "MySQL": {
    "name": "MySQL",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "An open-source relational database management system that is widely used for web applications and other lightweight applications. It is known for its ease of use and scalability.",
    "properties": {},
    "tags": []
  },
  "PostgreSQL": {
    "name": "PostgreSQL",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "An open-source object-relational database management system that offers advanced features such as data warehousing and geospatial data support. It is highly customizable and can handle complex data structures.",
    "properties": {},
    "tags": []
  },
  "MariaDB": {
    "name": "MariaDB",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A community-developed fork of MySQL that offers improved performance and scalability. It is used in a wide range of applications, from small personal databases to large enterprise systems.",
    "properties": {},
    "tags": []
  },
  "MongoDB": {
    "name": "MongoDB",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A NoSQL document database that offers high performance, scalability, and flexibility. It is popular for its ability to handle unstructured data and is used in a variety of applications, from mobile to IoT.",
    "properties": {},
    "tags": []
  },
  "Teradata Database": {
    "name": "Teradata Database",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A massively parallel relational database management system designed for large-scale data warehousing and analytics. It offers high performance and scalability for handling large volumes of data.",
    "properties": {},
    "tags": []
  },
  "Couchbase Server": {
    "name": "Couchbase Server",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A NoSQL document database that offers high availability, scalability, and performance. It is often used for mission-critical applications that require real-time data processing.",
    "properties": {},
    "tags": []
  },
  "SAP HANA": {
    "name": "SAP HANA",
    "type": "Relational Database",
    "classification": "Database Services",
    "iconUrl": "https://catio-public.s3.us-west-2.amazonaws.com/static/component-library/images/database_services.svg",
    "description": "A relational database management system developed by SAP that offers real-time data processing and analytics. It is designed for enterprise applications and offers high performance and scalability for handling large datasets.",
    "properties": {},
    "tags": []
  }
}
